TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11658                                      0x000019E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11659                                      0x000019EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11660                                      0x000019F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11661                                      0x000019F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11662                                      0x000019F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11663                                      0x000019FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11664                                      0x00001A00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11665                                      0x00001A04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11666                                      0x00001A08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11667                                      0x00001A0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11668                                      0x00001A10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11669                                      0x00001A14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11670                                      0x00001A18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11671                                      0x00001A1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11672                                      0x00001A20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11673                                      0x00001A24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11674                                      0x00001A28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11675                                      0x00001A2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11676                                      0x00001A30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11677                                      0x00001A34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11678                                      0x00001A38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11679                                      0x00001A3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11680                                      0x00001A40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11681                                      0x00001A44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11682                                      0x00001A48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11683                                      0x00001A4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11684                                      0x00001A50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11685                                      0x00001A54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11686                                      0x00001A58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11687                                      0x00001A5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11688                                      0x00001A60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11689                                      0x00001A64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11690                                      0x00001A68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11691                                      0x00001A6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11692                                      0x00001A70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11693                                      0x00001A74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11694                                      0x00001A78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11695                                      0x00001A7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11696                                      0x00001A80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11697                                      0x00001A84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11698                                      0x00001A88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11699                                      0x00001A8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11700                                      0x00001A90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11701                                      0x00001A94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11702                                      0x00001A98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11703                                      0x00001A9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11704                                      0x00001AA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11705                                      0x00001AA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11706                                      0x00001AA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11707                                      0x00001AAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11708                                      0x00001AB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11709                                      0x00001AB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11710                                      0x00001AB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11711                                      0x00001ABC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11712                                      0x00001AC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11713                                      0x00001AC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11714                                      0x00001AC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11715                                      0x00001ACC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11716                                      0x00001AD0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11717                                      0x00001AD4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11718                                      0x00001AD8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11719                                      0x00001ADC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11720                                      0x00001AE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11721                                      0x00001AE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11722                                      0x00001AE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11723                                      0x00001AEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11724                                      0x00001AF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11725                                      0x00001AF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11726                                      0x00001AF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11727                                      0x00001AFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11728                                      0x00001B00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11729                                      0x00001B04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11730                                      0x00001B08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11731                                      0x00001B0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11732                                      0x00001B10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11733                                      0x00001B14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11734                                      0x00001B18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11735                                      0x00001B1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11736                                      0x00001B20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11737                                      0x00001B24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11738                                      0x00001B28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11739                                      0x00001B2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11740                                      0x00001B30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11741                                      0x00001B34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11742                                      0x00001B38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11743                                      0x00001B3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11744                                      0x00001B40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11745                                      0x00001B44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11746                                      0x00001B48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11747                                      0x00001B4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11748                                      0x00001B50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11749                                      0x00001B54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11750                                      0x00001B58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11751                                      0x00001B5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11752                                      0x00001B60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11753                                      0x00001B64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11754                                      0x00001B68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11755                                      0x00001B6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11756                                      0x00001B70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11757                                      0x00001B74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11758                                      0x00001B78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11759                                      0x00001B7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11760                                      0x00001B80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11761                                      0x00001B84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11762                                      0x00001B88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11763                                      0x00001B8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11764                                      0x00001B90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11765                                      0x00001B94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11766                                      0x00001B98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11767                                      0x00001B9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11768                                      0x00001BA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11769                                      0x00001BA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11770                                      0x00001BA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11771                                      0x00001BAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11772                                      0x00001BB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11773                                      0x00001BB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11774                                      0x00001BB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11775                                      0x00001BBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11776                                      0x00001BC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11777                                      0x00001BC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11778                                      0x00001BC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11779                                      0x00001BCC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11780                                      0x00001BD0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11781                                      0x00001BD4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11782                                      0x00001BD8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11783                                      0x00001BDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11784                                      0x00001BE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11785                                      0x00001BE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11786                                      0x00001BE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11787                                      0x00001BEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11788                                      0x00001BF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11789                                      0x00001BF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11790                                      0x00001BF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11791                                      0x00001BFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11792                                      0x00001C00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11793                                      0x00001C04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11794                                      0x00001C08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11795                                      0x00001C0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11796                                      0x00001C10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11797                                      0x00001C14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11798                                      0x00001C18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11799                                      0x00001C1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11800                                      0x00001C20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11801                                      0x00001C24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11802                                      0x00001C28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11803                                      0x00001C2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11804                                      0x00001C30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11805                                      0x00001C34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11806                                      0x00001C38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11807                                      0x00001C3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11808                                      0x00001C40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11809                                      0x00001C44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11810                                      0x00001C48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11811                                      0x00001C4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11812                                      0x00001C50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11813                                      0x00001C54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11814                                      0x00001C58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11815                                      0x00001C5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11816                                      0x00001C60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11817                                      0x00001C64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11818                                      0x00001C68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11819                                      0x00001C6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11820                                      0x00001C70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11821                                      0x00001C74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11822                                      0x00001C78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11823                                      0x00001C7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11824                                      0x00001C80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11825                                      0x00001C84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11826                                      0x00001C88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11827                                      0x00001C8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11828                                      0x00001C90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11829                                      0x00001C94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11830                                      0x00001C98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11831                                      0x00001C9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11832                                      0x00001CA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11833                                      0x00001CA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11834                                      0x00001CA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11835                                      0x00001CAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11836                                      0x00001CB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11837                                      0x00001CB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11838                                      0x00001CB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11839                                      0x00001CBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11840                                      0x00001CC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11841                                      0x00001CC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11842                                      0x00001CC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11843                                      0x00001CCC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11844                                      0x00001CD0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11845                                      0x00001CD4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11846                                      0x00001CD8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11847                                      0x00001CDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11848                                      0x00001CE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11849                                      0x00001CE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11850                                      0x00001CE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11851                                      0x00001CEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11852                                      0x00001CF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11853                                      0x00001CF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11854                                      0x00001CF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11855                                      0x00001CFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11856                                      0x00001D00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11857                                      0x00001D04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11858                                      0x00001D08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11859                                      0x00001D0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11860                                      0x00001D10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11861                                      0x00001D14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11862                                      0x00001D18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11863                                      0x00001D1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11864                                      0x00001D20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11865                                      0x00001D24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11866                                      0x00001D28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11867                                      0x00001D2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11868                                      0x00001D30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11869                                      0x00001D34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11870                                      0x00001D38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11871                                      0x00001D3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11872                                      0x00001D40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11873                                      0x00001D44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11874                                      0x00001D48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11875                                      0x00001D4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11876                                      0x00001D50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11877                                      0x00001D54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11878                                      0x00001D58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11879                                      0x00001D5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11880                                      0x00001D60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11881                                      0x00001D64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11882                                      0x00001D68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11883                                      0x00001D6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11884                                      0x00001D70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11885                                      0x00001D74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11886                                      0x00001D78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11887                                      0x00001D7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11888                                      0x00001D80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11889                                      0x00001D84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11890                                      0x00001D88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11891                                      0x00001D8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11892                                      0x00001D90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11893                                      0x00001D94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11894                                      0x00001D98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11895                                      0x00001D9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11896                                      0x00001DA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11897                                      0x00001DA4

