TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11898                                      0x00001DA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11899                                      0x00001DAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11900                                      0x00001DB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11901                                      0x00001DB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11902                                      0x00001DB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11903                                      0x00001DBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11904                                      0x00001DC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11905                                      0x00001DC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11906                                      0x00001DC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11907                                      0x00001DCC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11908                                      0x00001DD0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11909                                      0x00001DD4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11910                                      0x00001DD8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11911                                      0x00001DDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11912                                      0x00001DE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11913                                      0x00001DE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11914                                      0x00001DE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11915                                      0x00001DEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11916                                      0x00001DF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11917                                      0x00001DF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11918                                      0x00001DF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11919                                      0x00001DFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11920                                      0x00001E00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11921                                      0x00001E04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11922                                      0x00001E08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11923                                      0x00001E0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11924                                      0x00001E10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11925                                      0x00001E14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11926                                      0x00001E18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11927                                      0x00001E1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11928                                      0x00001E20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11929                                      0x00001E24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11930                                      0x00001E28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11931                                      0x00001E2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11932                                      0x00001E30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11933                                      0x00001E34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11934                                      0x00001E38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11935                                      0x00001E3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11936                                      0x00001E40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11937                                      0x00001E44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11938                                      0x00001E48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11939                                      0x00001E4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11940                                      0x00001E50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11941                                      0x00001E54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11942                                      0x00001E58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11943                                      0x00001E5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11944                                      0x00001E60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11945                                      0x00001E64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11946                                      0x00001E68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11947                                      0x00001E6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11948                                      0x00001E70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11949                                      0x00001E74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11950                                      0x00001E78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11951                                      0x00001E7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11952                                      0x00001E80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11953                                      0x00001E84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11954                                      0x00001E88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11955                                      0x00001E8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11956                                      0x00001E90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11957                                      0x00001E94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11958                                      0x00001E98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11959                                      0x00001E9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11960                                      0x00001EA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11961                                      0x00001EA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11962                                      0x00001EA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11963                                      0x00001EAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11964                                      0x00001EB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11965                                      0x00001EB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11966                                      0x00001EB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11967                                      0x00001EBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11968                                      0x00001EC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11969                                      0x00001EC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11970                                      0x00001EC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11971                                      0x00001ECC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11972                                      0x00001ED0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11973                                      0x00001ED4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11974                                      0x00001ED8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11975                                      0x00001EDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11976                                      0x00001EE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11977                                      0x00001EE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11978                                      0x00001EE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11979                                      0x00001EEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11980                                      0x00001EF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11981                                      0x00001EF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11982                                      0x00001EF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11983                                      0x00001EFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11984                                      0x00001F00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11985                                      0x00001F04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11986                                      0x00001F08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11987                                      0x00001F0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11988                                      0x00001F10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11989                                      0x00001F14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11990                                      0x00001F18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11991                                      0x00001F1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11992                                      0x00001F20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11993                                      0x00001F24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11994                                      0x00001F28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11995                                      0x00001F2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11996                                      0x00001F30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11997                                      0x00001F34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11998                                      0x00001F38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11999                                      0x00001F3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12000                                      0x00001F40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12001                                      0x00001F44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12002                                      0x00001F48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12003                                      0x00001F4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12004                                      0x00001F50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12005                                      0x00001F54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12006                                      0x00001F58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12007                                      0x00001F5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12008                                      0x00001F60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12009                                      0x00001F64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12010                                      0x00001F68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12011                                      0x00001F6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12012                                      0x00001F70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12013                                      0x00001F74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12014                                      0x00001F78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12015                                      0x00001F7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12016                                      0x00001F80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12017                                      0x00001F84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12018                                      0x00001F88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12019                                      0x00001F8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12020                                      0x00001F90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12021                                      0x00001F94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12022                                      0x00001F98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12023                                      0x00001F9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12024                                      0x00001FA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12025                                      0x00001FA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12026                                      0x00001FA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12027                                      0x00001FAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12028                                      0x00001FB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12029                                      0x00001FB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12030                                      0x00001FB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12031                                      0x00001FBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12032                                      0x00001FC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12033                                      0x00001FC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12034                                      0x00001FC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12035                                      0x00001FCC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12036                                      0x00001FD0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12037                                      0x00001FD4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12038                                      0x00001FD8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12039                                      0x00001FDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12040                                      0x00001FE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12041                                      0x00001FE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12042                                      0x00001FE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12043                                      0x00001FEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12044                                      0x00001FF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12045                                      0x00001FF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12046                                      0x00001FF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12047                                      0x00001FFC

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK10
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK10_DATA_W                                            32
#define RFC_ULLRAM_BANK10_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK10_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11_DATA_W                                            32
#define RFC_ULLRAM_BANK11_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK11_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12_DATA_W                                            32
#define RFC_ULLRAM_BANK12_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK12_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK13
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK13_DATA_W                                            32
#define RFC_ULLRAM_BANK13_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK13_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK14
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK14_DATA_W                                            32
#define RFC_ULLRAM_BANK14_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK14_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK15
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK15_DATA_W                                            32
#define RFC_ULLRAM_BANK15_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK15_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK16
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK16_DATA_W                                            32
#define RFC_ULLRAM_BANK16_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK16_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK17
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK17_DATA_W                                            32
#define RFC_ULLRAM_BANK17_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK17_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK18
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK18_DATA_W                                            32
#define RFC_ULLRAM_BANK18_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK18_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK19
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK19_DATA_W                                            32
#define RFC_ULLRAM_BANK19_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK19_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK110
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK110_DATA_W                                           32
#define RFC_ULLRAM_BANK110_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK110_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK111
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK111_DATA_W                                           32
#define RFC_ULLRAM_BANK111_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK111_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK112
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK112_DATA_W                                           32
#define RFC_ULLRAM_BANK112_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK112_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK113
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK113_DATA_W                                           32
#define RFC_ULLRAM_BANK113_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK113_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK114
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK114_DATA_W                                           32
#define RFC_ULLRAM_BANK114_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK114_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK115
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK115_DATA_W                                           32
#define RFC_ULLRAM_BANK115_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK115_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK116
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK116_DATA_W                                           32
#define RFC_ULLRAM_BANK116_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK116_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK117
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK117_DATA_W                                           32
#define RFC_ULLRAM_BANK117_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK117_DATA_S                                            0

