TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK118
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK118_DATA_W                                           32
#define RFC_ULLRAM_BANK118_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK118_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK119
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK119_DATA_W                                           32
#define RFC_ULLRAM_BANK119_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK119_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK120
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK120_DATA_W                                           32
#define RFC_ULLRAM_BANK120_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK120_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK121
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK121_DATA_W                                           32
#define RFC_ULLRAM_BANK121_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK121_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK122
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK122_DATA_W                                           32
#define RFC_ULLRAM_BANK122_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK122_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK123
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK123_DATA_W                                           32
#define RFC_ULLRAM_BANK123_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK123_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK124
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK124_DATA_W                                           32
#define RFC_ULLRAM_BANK124_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK124_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK125
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK125_DATA_W                                           32
#define RFC_ULLRAM_BANK125_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK125_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK126
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK126_DATA_W                                           32
#define RFC_ULLRAM_BANK126_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK126_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK127
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK127_DATA_W                                           32
#define RFC_ULLRAM_BANK127_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK127_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK128
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK128_DATA_W                                           32
#define RFC_ULLRAM_BANK128_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK128_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK129
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK129_DATA_W                                           32
#define RFC_ULLRAM_BANK129_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK129_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK130
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK130_DATA_W                                           32
#define RFC_ULLRAM_BANK130_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK130_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK131
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK131_DATA_W                                           32
#define RFC_ULLRAM_BANK131_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK131_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK132
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK132_DATA_W                                           32
#define RFC_ULLRAM_BANK132_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK132_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK133
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK133_DATA_W                                           32
#define RFC_ULLRAM_BANK133_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK133_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK134
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK134_DATA_W                                           32
#define RFC_ULLRAM_BANK134_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK134_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK135
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK135_DATA_W                                           32
#define RFC_ULLRAM_BANK135_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK135_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK136
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK136_DATA_W                                           32
#define RFC_ULLRAM_BANK136_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK136_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK137
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK137_DATA_W                                           32
#define RFC_ULLRAM_BANK137_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK137_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK138
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK138_DATA_W                                           32
#define RFC_ULLRAM_BANK138_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK138_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK139
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK139_DATA_W                                           32
#define RFC_ULLRAM_BANK139_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK139_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK140
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK140_DATA_W                                           32
#define RFC_ULLRAM_BANK140_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK140_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK141
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK141_DATA_W                                           32
#define RFC_ULLRAM_BANK141_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK141_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK142
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK142_DATA_W                                           32
#define RFC_ULLRAM_BANK142_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK142_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK143
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK143_DATA_W                                           32
#define RFC_ULLRAM_BANK143_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK143_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK144
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK144_DATA_W                                           32
#define RFC_ULLRAM_BANK144_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK144_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK145
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK145_DATA_W                                           32
#define RFC_ULLRAM_BANK145_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK145_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK146
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK146_DATA_W                                           32
#define RFC_ULLRAM_BANK146_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK146_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK147
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK147_DATA_W                                           32
#define RFC_ULLRAM_BANK147_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK147_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK148
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK148_DATA_W                                           32
#define RFC_ULLRAM_BANK148_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK148_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK149
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK149_DATA_W                                           32
#define RFC_ULLRAM_BANK149_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK149_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK150
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK150_DATA_W                                           32
#define RFC_ULLRAM_BANK150_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK150_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK151
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK151_DATA_W                                           32
#define RFC_ULLRAM_BANK151_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK151_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK152
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK152_DATA_W                                           32
#define RFC_ULLRAM_BANK152_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK152_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK153
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK153_DATA_W                                           32
#define RFC_ULLRAM_BANK153_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK153_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK154
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK154_DATA_W                                           32
#define RFC_ULLRAM_BANK154_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK154_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK155
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK155_DATA_W                                           32
#define RFC_ULLRAM_BANK155_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK155_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK156
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK156_DATA_W                                           32
#define RFC_ULLRAM_BANK156_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK156_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK157
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK157_DATA_W                                           32
#define RFC_ULLRAM_BANK157_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK157_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK158
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK158_DATA_W                                           32
#define RFC_ULLRAM_BANK158_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK158_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK159
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK159_DATA_W                                           32
#define RFC_ULLRAM_BANK159_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK159_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK160
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK160_DATA_W                                           32
#define RFC_ULLRAM_BANK160_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK160_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK161
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK161_DATA_W                                           32
#define RFC_ULLRAM_BANK161_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK161_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK162
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK162_DATA_W                                           32
#define RFC_ULLRAM_BANK162_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK162_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK163
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK163_DATA_W                                           32
#define RFC_ULLRAM_BANK163_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK163_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK164
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK164_DATA_W                                           32
#define RFC_ULLRAM_BANK164_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK164_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK165
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK165_DATA_W                                           32
#define RFC_ULLRAM_BANK165_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK165_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK166
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK166_DATA_W                                           32
#define RFC_ULLRAM_BANK166_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK166_DATA_S                                            0

