TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK167
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK167_DATA_W                                           32
#define RFC_ULLRAM_BANK167_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK167_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK168
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK168_DATA_W                                           32
#define RFC_ULLRAM_BANK168_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK168_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK169
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK169_DATA_W                                           32
#define RFC_ULLRAM_BANK169_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK169_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK170
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK170_DATA_W                                           32
#define RFC_ULLRAM_BANK170_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK170_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK171
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK171_DATA_W                                           32
#define RFC_ULLRAM_BANK171_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK171_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK172
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK172_DATA_W                                           32
#define RFC_ULLRAM_BANK172_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK172_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK173
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK173_DATA_W                                           32
#define RFC_ULLRAM_BANK173_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK173_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK174
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK174_DATA_W                                           32
#define RFC_ULLRAM_BANK174_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK174_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK175
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK175_DATA_W                                           32
#define RFC_ULLRAM_BANK175_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK175_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK176
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK176_DATA_W                                           32
#define RFC_ULLRAM_BANK176_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK176_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK177
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK177_DATA_W                                           32
#define RFC_ULLRAM_BANK177_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK177_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK178
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK178_DATA_W                                           32
#define RFC_ULLRAM_BANK178_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK178_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK179
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK179_DATA_W                                           32
#define RFC_ULLRAM_BANK179_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK179_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK180
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK180_DATA_W                                           32
#define RFC_ULLRAM_BANK180_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK180_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK181
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK181_DATA_W                                           32
#define RFC_ULLRAM_BANK181_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK181_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK182
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK182_DATA_W                                           32
#define RFC_ULLRAM_BANK182_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK182_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK183
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK183_DATA_W                                           32
#define RFC_ULLRAM_BANK183_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK183_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK184
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK184_DATA_W                                           32
#define RFC_ULLRAM_BANK184_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK184_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK185
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK185_DATA_W                                           32
#define RFC_ULLRAM_BANK185_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK185_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK186
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK186_DATA_W                                           32
#define RFC_ULLRAM_BANK186_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK186_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK187
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK187_DATA_W                                           32
#define RFC_ULLRAM_BANK187_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK187_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK188
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK188_DATA_W                                           32
#define RFC_ULLRAM_BANK188_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK188_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK189
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK189_DATA_W                                           32
#define RFC_ULLRAM_BANK189_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK189_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK190
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK190_DATA_W                                           32
#define RFC_ULLRAM_BANK190_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK190_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK191
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK191_DATA_W                                           32
#define RFC_ULLRAM_BANK191_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK191_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK192
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK192_DATA_W                                           32
#define RFC_ULLRAM_BANK192_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK192_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK193
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK193_DATA_W                                           32
#define RFC_ULLRAM_BANK193_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK193_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK194
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK194_DATA_W                                           32
#define RFC_ULLRAM_BANK194_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK194_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK195
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK195_DATA_W                                           32
#define RFC_ULLRAM_BANK195_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK195_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK196
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK196_DATA_W                                           32
#define RFC_ULLRAM_BANK196_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK196_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK197
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK197_DATA_W                                           32
#define RFC_ULLRAM_BANK197_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK197_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK198
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK198_DATA_W                                           32
#define RFC_ULLRAM_BANK198_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK198_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK199
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK199_DATA_W                                           32
#define RFC_ULLRAM_BANK199_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK199_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1100
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1100_DATA_W                                          32
#define RFC_ULLRAM_BANK1100_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1100_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1101
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1101_DATA_W                                          32
#define RFC_ULLRAM_BANK1101_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1101_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1102
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1102_DATA_W                                          32
#define RFC_ULLRAM_BANK1102_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1102_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1103
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1103_DATA_W                                          32
#define RFC_ULLRAM_BANK1103_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1103_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1104
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1104_DATA_W                                          32
#define RFC_ULLRAM_BANK1104_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1104_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1105
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1105_DATA_W                                          32
#define RFC_ULLRAM_BANK1105_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1105_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1106
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1106_DATA_W                                          32
#define RFC_ULLRAM_BANK1106_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1106_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1107
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1107_DATA_W                                          32
#define RFC_ULLRAM_BANK1107_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1107_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1108
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1108_DATA_W                                          32
#define RFC_ULLRAM_BANK1108_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1108_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1109
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1109_DATA_W                                          32
#define RFC_ULLRAM_BANK1109_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1109_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1110
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1110_DATA_W                                          32
#define RFC_ULLRAM_BANK1110_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1110_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1111
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1111_DATA_W                                          32
#define RFC_ULLRAM_BANK1111_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1111_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1112
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1112_DATA_W                                          32
#define RFC_ULLRAM_BANK1112_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1112_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1113
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1113_DATA_W                                          32
#define RFC_ULLRAM_BANK1113_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1113_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1114
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1114_DATA_W                                          32
#define RFC_ULLRAM_BANK1114_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1114_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1115
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1115_DATA_W                                          32
#define RFC_ULLRAM_BANK1115_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1115_DATA_S                                           0

