TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1116
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1116_DATA_W                                          32
#define RFC_ULLRAM_BANK1116_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1116_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1117
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1117_DATA_W                                          32
#define RFC_ULLRAM_BANK1117_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1117_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1118
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1118_DATA_W                                          32
#define RFC_ULLRAM_BANK1118_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1118_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1119
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1119_DATA_W                                          32
#define RFC_ULLRAM_BANK1119_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1119_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1120
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1120_DATA_W                                          32
#define RFC_ULLRAM_BANK1120_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1120_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1121
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1121_DATA_W                                          32
#define RFC_ULLRAM_BANK1121_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1121_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1122
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1122_DATA_W                                          32
#define RFC_ULLRAM_BANK1122_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1122_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1123
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1123_DATA_W                                          32
#define RFC_ULLRAM_BANK1123_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1123_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1124
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1124_DATA_W                                          32
#define RFC_ULLRAM_BANK1124_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1124_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1125
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1125_DATA_W                                          32
#define RFC_ULLRAM_BANK1125_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1125_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1126
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1126_DATA_W                                          32
#define RFC_ULLRAM_BANK1126_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1126_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1127
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1127_DATA_W                                          32
#define RFC_ULLRAM_BANK1127_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1127_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1128
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1128_DATA_W                                          32
#define RFC_ULLRAM_BANK1128_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1128_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1129
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1129_DATA_W                                          32
#define RFC_ULLRAM_BANK1129_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1129_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1130
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1130_DATA_W                                          32
#define RFC_ULLRAM_BANK1130_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1130_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1131
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1131_DATA_W                                          32
#define RFC_ULLRAM_BANK1131_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1131_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1132
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1132_DATA_W                                          32
#define RFC_ULLRAM_BANK1132_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1132_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1133
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1133_DATA_W                                          32
#define RFC_ULLRAM_BANK1133_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1133_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1134
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1134_DATA_W                                          32
#define RFC_ULLRAM_BANK1134_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1134_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1135
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1135_DATA_W                                          32
#define RFC_ULLRAM_BANK1135_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1135_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1136
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1136_DATA_W                                          32
#define RFC_ULLRAM_BANK1136_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1136_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1137
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1137_DATA_W                                          32
#define RFC_ULLRAM_BANK1137_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1137_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1138
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1138_DATA_W                                          32
#define RFC_ULLRAM_BANK1138_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1138_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1139
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1139_DATA_W                                          32
#define RFC_ULLRAM_BANK1139_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1139_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1140
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1140_DATA_W                                          32
#define RFC_ULLRAM_BANK1140_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1140_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1141
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1141_DATA_W                                          32
#define RFC_ULLRAM_BANK1141_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1141_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1142
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1142_DATA_W                                          32
#define RFC_ULLRAM_BANK1142_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1142_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1143
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1143_DATA_W                                          32
#define RFC_ULLRAM_BANK1143_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1143_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1144
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1144_DATA_W                                          32
#define RFC_ULLRAM_BANK1144_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1144_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1145
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1145_DATA_W                                          32
#define RFC_ULLRAM_BANK1145_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1145_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1146
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1146_DATA_W                                          32
#define RFC_ULLRAM_BANK1146_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1146_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1147
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1147_DATA_W                                          32
#define RFC_ULLRAM_BANK1147_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1147_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1148
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1148_DATA_W                                          32
#define RFC_ULLRAM_BANK1148_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1148_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1149
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1149_DATA_W                                          32
#define RFC_ULLRAM_BANK1149_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1149_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1150
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1150_DATA_W                                          32
#define RFC_ULLRAM_BANK1150_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1150_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1151
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1151_DATA_W                                          32
#define RFC_ULLRAM_BANK1151_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1151_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1152
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1152_DATA_W                                          32
#define RFC_ULLRAM_BANK1152_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1152_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1153
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1153_DATA_W                                          32
#define RFC_ULLRAM_BANK1153_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1153_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1154
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1154_DATA_W                                          32
#define RFC_ULLRAM_BANK1154_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1154_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1155
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1155_DATA_W                                          32
#define RFC_ULLRAM_BANK1155_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1155_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1156
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1156_DATA_W                                          32
#define RFC_ULLRAM_BANK1156_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1156_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1157
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1157_DATA_W                                          32
#define RFC_ULLRAM_BANK1157_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1157_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1158
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1158_DATA_W                                          32
#define RFC_ULLRAM_BANK1158_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1158_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1159
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1159_DATA_W                                          32
#define RFC_ULLRAM_BANK1159_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1159_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1160
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1160_DATA_W                                          32
#define RFC_ULLRAM_BANK1160_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1160_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1161
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1161_DATA_W                                          32
#define RFC_ULLRAM_BANK1161_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1161_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1162
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1162_DATA_W                                          32
#define RFC_ULLRAM_BANK1162_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1162_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1163
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1163_DATA_W                                          32
#define RFC_ULLRAM_BANK1163_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1163_DATA_S                                           0

