TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1164
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1164_DATA_W                                          32
#define RFC_ULLRAM_BANK1164_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1164_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1165
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1165_DATA_W                                          32
#define RFC_ULLRAM_BANK1165_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1165_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1166
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1166_DATA_W                                          32
#define RFC_ULLRAM_BANK1166_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1166_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1167
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1167_DATA_W                                          32
#define RFC_ULLRAM_BANK1167_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1167_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1168
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1168_DATA_W                                          32
#define RFC_ULLRAM_BANK1168_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1168_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1169
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1169_DATA_W                                          32
#define RFC_ULLRAM_BANK1169_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1169_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1170
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1170_DATA_W                                          32
#define RFC_ULLRAM_BANK1170_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1170_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1171
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1171_DATA_W                                          32
#define RFC_ULLRAM_BANK1171_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1171_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1172
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1172_DATA_W                                          32
#define RFC_ULLRAM_BANK1172_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1172_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1173
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1173_DATA_W                                          32
#define RFC_ULLRAM_BANK1173_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1173_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1174
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1174_DATA_W                                          32
#define RFC_ULLRAM_BANK1174_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1174_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1175
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1175_DATA_W                                          32
#define RFC_ULLRAM_BANK1175_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1175_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1176
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1176_DATA_W                                          32
#define RFC_ULLRAM_BANK1176_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1176_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1177
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1177_DATA_W                                          32
#define RFC_ULLRAM_BANK1177_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1177_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1178
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1178_DATA_W                                          32
#define RFC_ULLRAM_BANK1178_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1178_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1179
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1179_DATA_W                                          32
#define RFC_ULLRAM_BANK1179_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1179_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1180
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1180_DATA_W                                          32
#define RFC_ULLRAM_BANK1180_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1180_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1181
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1181_DATA_W                                          32
#define RFC_ULLRAM_BANK1181_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1181_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1182
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1182_DATA_W                                          32
#define RFC_ULLRAM_BANK1182_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1182_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1183
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1183_DATA_W                                          32
#define RFC_ULLRAM_BANK1183_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1183_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1184
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1184_DATA_W                                          32
#define RFC_ULLRAM_BANK1184_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1184_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1185
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1185_DATA_W                                          32
#define RFC_ULLRAM_BANK1185_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1185_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1186
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1186_DATA_W                                          32
#define RFC_ULLRAM_BANK1186_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1186_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1187
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1187_DATA_W                                          32
#define RFC_ULLRAM_BANK1187_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1187_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1188
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1188_DATA_W                                          32
#define RFC_ULLRAM_BANK1188_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1188_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1189
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1189_DATA_W                                          32
#define RFC_ULLRAM_BANK1189_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1189_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1190
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1190_DATA_W                                          32
#define RFC_ULLRAM_BANK1190_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1190_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1191
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1191_DATA_W                                          32
#define RFC_ULLRAM_BANK1191_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1191_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1192
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1192_DATA_W                                          32
#define RFC_ULLRAM_BANK1192_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1192_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1193
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1193_DATA_W                                          32
#define RFC_ULLRAM_BANK1193_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1193_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1194
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1194_DATA_W                                          32
#define RFC_ULLRAM_BANK1194_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1194_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1195
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1195_DATA_W                                          32
#define RFC_ULLRAM_BANK1195_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1195_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1196
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1196_DATA_W                                          32
#define RFC_ULLRAM_BANK1196_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1196_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1197
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1197_DATA_W                                          32
#define RFC_ULLRAM_BANK1197_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1197_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1198
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1198_DATA_W                                          32
#define RFC_ULLRAM_BANK1198_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1198_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1199
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1199_DATA_W                                          32
#define RFC_ULLRAM_BANK1199_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1199_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1200
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1200_DATA_W                                          32
#define RFC_ULLRAM_BANK1200_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1200_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1201
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1201_DATA_W                                          32
#define RFC_ULLRAM_BANK1201_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1201_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1202
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1202_DATA_W                                          32
#define RFC_ULLRAM_BANK1202_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1202_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1203
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1203_DATA_W                                          32
#define RFC_ULLRAM_BANK1203_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1203_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1204
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1204_DATA_W                                          32
#define RFC_ULLRAM_BANK1204_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1204_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1205
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1205_DATA_W                                          32
#define RFC_ULLRAM_BANK1205_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1205_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1206
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1206_DATA_W                                          32
#define RFC_ULLRAM_BANK1206_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1206_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1207
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1207_DATA_W                                          32
#define RFC_ULLRAM_BANK1207_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1207_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1208
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1208_DATA_W                                          32
#define RFC_ULLRAM_BANK1208_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1208_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1209
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1209_DATA_W                                          32
#define RFC_ULLRAM_BANK1209_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1209_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1210
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1210_DATA_W                                          32
#define RFC_ULLRAM_BANK1210_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1210_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1211
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1211_DATA_W                                          32
#define RFC_ULLRAM_BANK1211_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1211_DATA_S                                           0

