TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1212
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1212_DATA_W                                          32
#define RFC_ULLRAM_BANK1212_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1212_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1213
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1213_DATA_W                                          32
#define RFC_ULLRAM_BANK1213_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1213_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1214
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1214_DATA_W                                          32
#define RFC_ULLRAM_BANK1214_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1214_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1215
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1215_DATA_W                                          32
#define RFC_ULLRAM_BANK1215_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1215_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1216
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1216_DATA_W                                          32
#define RFC_ULLRAM_BANK1216_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1216_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1217
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1217_DATA_W                                          32
#define RFC_ULLRAM_BANK1217_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1217_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1218
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1218_DATA_W                                          32
#define RFC_ULLRAM_BANK1218_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1218_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1219
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1219_DATA_W                                          32
#define RFC_ULLRAM_BANK1219_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1219_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1220
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1220_DATA_W                                          32
#define RFC_ULLRAM_BANK1220_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1220_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1221
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1221_DATA_W                                          32
#define RFC_ULLRAM_BANK1221_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1221_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1222
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1222_DATA_W                                          32
#define RFC_ULLRAM_BANK1222_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1222_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1223
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1223_DATA_W                                          32
#define RFC_ULLRAM_BANK1223_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1223_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1224
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1224_DATA_W                                          32
#define RFC_ULLRAM_BANK1224_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1224_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1225
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1225_DATA_W                                          32
#define RFC_ULLRAM_BANK1225_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1225_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1226
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1226_DATA_W                                          32
#define RFC_ULLRAM_BANK1226_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1226_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1227
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1227_DATA_W                                          32
#define RFC_ULLRAM_BANK1227_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1227_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1228
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1228_DATA_W                                          32
#define RFC_ULLRAM_BANK1228_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1228_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1229
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1229_DATA_W                                          32
#define RFC_ULLRAM_BANK1229_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1229_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1230
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1230_DATA_W                                          32
#define RFC_ULLRAM_BANK1230_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1230_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1231
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1231_DATA_W                                          32
#define RFC_ULLRAM_BANK1231_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1231_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1232
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1232_DATA_W                                          32
#define RFC_ULLRAM_BANK1232_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1232_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1233
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1233_DATA_W                                          32
#define RFC_ULLRAM_BANK1233_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1233_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1234
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1234_DATA_W                                          32
#define RFC_ULLRAM_BANK1234_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1234_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1235
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1235_DATA_W                                          32
#define RFC_ULLRAM_BANK1235_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1235_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1236
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1236_DATA_W                                          32
#define RFC_ULLRAM_BANK1236_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1236_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1237
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1237_DATA_W                                          32
#define RFC_ULLRAM_BANK1237_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1237_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1238
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1238_DATA_W                                          32
#define RFC_ULLRAM_BANK1238_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1238_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1239
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1239_DATA_W                                          32
#define RFC_ULLRAM_BANK1239_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1239_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1240
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1240_DATA_W                                          32
#define RFC_ULLRAM_BANK1240_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1240_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1241
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1241_DATA_W                                          32
#define RFC_ULLRAM_BANK1241_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1241_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1242
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1242_DATA_W                                          32
#define RFC_ULLRAM_BANK1242_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1242_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1243
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1243_DATA_W                                          32
#define RFC_ULLRAM_BANK1243_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1243_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1244
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1244_DATA_W                                          32
#define RFC_ULLRAM_BANK1244_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1244_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1245
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1245_DATA_W                                          32
#define RFC_ULLRAM_BANK1245_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1245_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1246
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1246_DATA_W                                          32
#define RFC_ULLRAM_BANK1246_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1246_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1247
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1247_DATA_W                                          32
#define RFC_ULLRAM_BANK1247_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1247_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1248
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1248_DATA_W                                          32
#define RFC_ULLRAM_BANK1248_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1248_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1249
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1249_DATA_W                                          32
#define RFC_ULLRAM_BANK1249_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1249_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1250
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1250_DATA_W                                          32
#define RFC_ULLRAM_BANK1250_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1250_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1251
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1251_DATA_W                                          32
#define RFC_ULLRAM_BANK1251_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1251_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1252
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1252_DATA_W                                          32
#define RFC_ULLRAM_BANK1252_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1252_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1253
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1253_DATA_W                                          32
#define RFC_ULLRAM_BANK1253_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1253_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1254
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1254_DATA_W                                          32
#define RFC_ULLRAM_BANK1254_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1254_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1255
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1255_DATA_W                                          32
#define RFC_ULLRAM_BANK1255_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1255_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1256
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1256_DATA_W                                          32
#define RFC_ULLRAM_BANK1256_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1256_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1257
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1257_DATA_W                                          32
#define RFC_ULLRAM_BANK1257_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1257_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1258
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1258_DATA_W                                          32
#define RFC_ULLRAM_BANK1258_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1258_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1259
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1259_DATA_W                                          32
#define RFC_ULLRAM_BANK1259_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1259_DATA_S                                           0

