TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1260
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1260_DATA_W                                          32
#define RFC_ULLRAM_BANK1260_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1260_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1261
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1261_DATA_W                                          32
#define RFC_ULLRAM_BANK1261_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1261_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1262
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1262_DATA_W                                          32
#define RFC_ULLRAM_BANK1262_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1262_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1263
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1263_DATA_W                                          32
#define RFC_ULLRAM_BANK1263_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1263_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1264
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1264_DATA_W                                          32
#define RFC_ULLRAM_BANK1264_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1264_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1265
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1265_DATA_W                                          32
#define RFC_ULLRAM_BANK1265_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1265_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1266
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1266_DATA_W                                          32
#define RFC_ULLRAM_BANK1266_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1266_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1267
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1267_DATA_W                                          32
#define RFC_ULLRAM_BANK1267_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1267_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1268
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1268_DATA_W                                          32
#define RFC_ULLRAM_BANK1268_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1268_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1269
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1269_DATA_W                                          32
#define RFC_ULLRAM_BANK1269_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1269_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1270
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1270_DATA_W                                          32
#define RFC_ULLRAM_BANK1270_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1270_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1271
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1271_DATA_W                                          32
#define RFC_ULLRAM_BANK1271_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1271_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1272
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1272_DATA_W                                          32
#define RFC_ULLRAM_BANK1272_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1272_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1273
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1273_DATA_W                                          32
#define RFC_ULLRAM_BANK1273_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1273_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1274
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1274_DATA_W                                          32
#define RFC_ULLRAM_BANK1274_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1274_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1275
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1275_DATA_W                                          32
#define RFC_ULLRAM_BANK1275_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1275_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1276
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1276_DATA_W                                          32
#define RFC_ULLRAM_BANK1276_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1276_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1277
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1277_DATA_W                                          32
#define RFC_ULLRAM_BANK1277_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1277_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1278
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1278_DATA_W                                          32
#define RFC_ULLRAM_BANK1278_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1278_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1279
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1279_DATA_W                                          32
#define RFC_ULLRAM_BANK1279_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1279_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1280
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1280_DATA_W                                          32
#define RFC_ULLRAM_BANK1280_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1280_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1281
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1281_DATA_W                                          32
#define RFC_ULLRAM_BANK1281_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1281_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1282
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1282_DATA_W                                          32
#define RFC_ULLRAM_BANK1282_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1282_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1283
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1283_DATA_W                                          32
#define RFC_ULLRAM_BANK1283_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1283_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1284
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1284_DATA_W                                          32
#define RFC_ULLRAM_BANK1284_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1284_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1285
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1285_DATA_W                                          32
#define RFC_ULLRAM_BANK1285_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1285_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1286
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1286_DATA_W                                          32
#define RFC_ULLRAM_BANK1286_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1286_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1287
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1287_DATA_W                                          32
#define RFC_ULLRAM_BANK1287_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1287_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1288
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1288_DATA_W                                          32
#define RFC_ULLRAM_BANK1288_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1288_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1289
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1289_DATA_W                                          32
#define RFC_ULLRAM_BANK1289_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1289_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1290
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1290_DATA_W                                          32
#define RFC_ULLRAM_BANK1290_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1290_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1291
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1291_DATA_W                                          32
#define RFC_ULLRAM_BANK1291_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1291_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1292
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1292_DATA_W                                          32
#define RFC_ULLRAM_BANK1292_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1292_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1293
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1293_DATA_W                                          32
#define RFC_ULLRAM_BANK1293_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1293_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1294
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1294_DATA_W                                          32
#define RFC_ULLRAM_BANK1294_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1294_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1295
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1295_DATA_W                                          32
#define RFC_ULLRAM_BANK1295_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1295_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1296
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1296_DATA_W                                          32
#define RFC_ULLRAM_BANK1296_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1296_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1297
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1297_DATA_W                                          32
#define RFC_ULLRAM_BANK1297_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1297_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1298
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1298_DATA_W                                          32
#define RFC_ULLRAM_BANK1298_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1298_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1299
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1299_DATA_W                                          32
#define RFC_ULLRAM_BANK1299_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1299_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1300
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1300_DATA_W                                          32
#define RFC_ULLRAM_BANK1300_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1300_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1301
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1301_DATA_W                                          32
#define RFC_ULLRAM_BANK1301_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1301_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1302
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1302_DATA_W                                          32
#define RFC_ULLRAM_BANK1302_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1302_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1303
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1303_DATA_W                                          32
#define RFC_ULLRAM_BANK1303_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1303_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1304
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1304_DATA_W                                          32
#define RFC_ULLRAM_BANK1304_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1304_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1305
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1305_DATA_W                                          32
#define RFC_ULLRAM_BANK1305_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1305_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1306
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1306_DATA_W                                          32
#define RFC_ULLRAM_BANK1306_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1306_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1307
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1307_DATA_W                                          32
#define RFC_ULLRAM_BANK1307_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1307_DATA_S                                           0

