TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1308
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1308_DATA_W                                          32
#define RFC_ULLRAM_BANK1308_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1308_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1309
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1309_DATA_W                                          32
#define RFC_ULLRAM_BANK1309_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1309_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1310
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1310_DATA_W                                          32
#define RFC_ULLRAM_BANK1310_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1310_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1311
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1311_DATA_W                                          32
#define RFC_ULLRAM_BANK1311_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1311_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1312
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1312_DATA_W                                          32
#define RFC_ULLRAM_BANK1312_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1312_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1313
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1313_DATA_W                                          32
#define RFC_ULLRAM_BANK1313_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1313_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1314
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1314_DATA_W                                          32
#define RFC_ULLRAM_BANK1314_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1314_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1315
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1315_DATA_W                                          32
#define RFC_ULLRAM_BANK1315_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1315_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1316
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1316_DATA_W                                          32
#define RFC_ULLRAM_BANK1316_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1316_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1317
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1317_DATA_W                                          32
#define RFC_ULLRAM_BANK1317_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1317_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1318
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1318_DATA_W                                          32
#define RFC_ULLRAM_BANK1318_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1318_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1319
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1319_DATA_W                                          32
#define RFC_ULLRAM_BANK1319_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1319_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1320
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1320_DATA_W                                          32
#define RFC_ULLRAM_BANK1320_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1320_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1321
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1321_DATA_W                                          32
#define RFC_ULLRAM_BANK1321_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1321_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1322
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1322_DATA_W                                          32
#define RFC_ULLRAM_BANK1322_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1322_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1323
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1323_DATA_W                                          32
#define RFC_ULLRAM_BANK1323_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1323_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1324
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1324_DATA_W                                          32
#define RFC_ULLRAM_BANK1324_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1324_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1325
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1325_DATA_W                                          32
#define RFC_ULLRAM_BANK1325_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1325_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1326
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1326_DATA_W                                          32
#define RFC_ULLRAM_BANK1326_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1326_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1327
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1327_DATA_W                                          32
#define RFC_ULLRAM_BANK1327_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1327_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1328
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1328_DATA_W                                          32
#define RFC_ULLRAM_BANK1328_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1328_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1329
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1329_DATA_W                                          32
#define RFC_ULLRAM_BANK1329_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1329_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1330
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1330_DATA_W                                          32
#define RFC_ULLRAM_BANK1330_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1330_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1331
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1331_DATA_W                                          32
#define RFC_ULLRAM_BANK1331_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1331_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1332
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1332_DATA_W                                          32
#define RFC_ULLRAM_BANK1332_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1332_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1333
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1333_DATA_W                                          32
#define RFC_ULLRAM_BANK1333_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1333_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1334
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1334_DATA_W                                          32
#define RFC_ULLRAM_BANK1334_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1334_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1335
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1335_DATA_W                                          32
#define RFC_ULLRAM_BANK1335_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1335_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1336
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1336_DATA_W                                          32
#define RFC_ULLRAM_BANK1336_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1336_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1337
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1337_DATA_W                                          32
#define RFC_ULLRAM_BANK1337_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1337_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1338
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1338_DATA_W                                          32
#define RFC_ULLRAM_BANK1338_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1338_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1339
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1339_DATA_W                                          32
#define RFC_ULLRAM_BANK1339_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1339_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1340
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1340_DATA_W                                          32
#define RFC_ULLRAM_BANK1340_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1340_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1341
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1341_DATA_W                                          32
#define RFC_ULLRAM_BANK1341_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1341_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1342
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1342_DATA_W                                          32
#define RFC_ULLRAM_BANK1342_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1342_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1343
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1343_DATA_W                                          32
#define RFC_ULLRAM_BANK1343_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1343_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1344
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1344_DATA_W                                          32
#define RFC_ULLRAM_BANK1344_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1344_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1345
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1345_DATA_W                                          32
#define RFC_ULLRAM_BANK1345_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1345_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1346
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1346_DATA_W                                          32
#define RFC_ULLRAM_BANK1346_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1346_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1347
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1347_DATA_W                                          32
#define RFC_ULLRAM_BANK1347_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1347_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1348
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1348_DATA_W                                          32
#define RFC_ULLRAM_BANK1348_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1348_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1349
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1349_DATA_W                                          32
#define RFC_ULLRAM_BANK1349_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1349_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1350
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1350_DATA_W                                          32
#define RFC_ULLRAM_BANK1350_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1350_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1351
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1351_DATA_W                                          32
#define RFC_ULLRAM_BANK1351_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1351_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1352
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1352_DATA_W                                          32
#define RFC_ULLRAM_BANK1352_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1352_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1353
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1353_DATA_W                                          32
#define RFC_ULLRAM_BANK1353_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1353_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1354
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1354_DATA_W                                          32
#define RFC_ULLRAM_BANK1354_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1354_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1355
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1355_DATA_W                                          32
#define RFC_ULLRAM_BANK1355_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1355_DATA_S                                           0

