TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1356
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1356_DATA_W                                          32
#define RFC_ULLRAM_BANK1356_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1356_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1357
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1357_DATA_W                                          32
#define RFC_ULLRAM_BANK1357_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1357_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1358
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1358_DATA_W                                          32
#define RFC_ULLRAM_BANK1358_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1358_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1359
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1359_DATA_W                                          32
#define RFC_ULLRAM_BANK1359_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1359_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1360
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1360_DATA_W                                          32
#define RFC_ULLRAM_BANK1360_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1360_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1361
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1361_DATA_W                                          32
#define RFC_ULLRAM_BANK1361_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1361_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1362
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1362_DATA_W                                          32
#define RFC_ULLRAM_BANK1362_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1362_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1363
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1363_DATA_W                                          32
#define RFC_ULLRAM_BANK1363_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1363_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1364
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1364_DATA_W                                          32
#define RFC_ULLRAM_BANK1364_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1364_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1365
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1365_DATA_W                                          32
#define RFC_ULLRAM_BANK1365_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1365_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1366
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1366_DATA_W                                          32
#define RFC_ULLRAM_BANK1366_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1366_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1367
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1367_DATA_W                                          32
#define RFC_ULLRAM_BANK1367_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1367_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1368
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1368_DATA_W                                          32
#define RFC_ULLRAM_BANK1368_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1368_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1369
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1369_DATA_W                                          32
#define RFC_ULLRAM_BANK1369_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1369_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1370
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1370_DATA_W                                          32
#define RFC_ULLRAM_BANK1370_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1370_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1371
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1371_DATA_W                                          32
#define RFC_ULLRAM_BANK1371_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1371_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1372
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1372_DATA_W                                          32
#define RFC_ULLRAM_BANK1372_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1372_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1373
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1373_DATA_W                                          32
#define RFC_ULLRAM_BANK1373_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1373_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1374
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1374_DATA_W                                          32
#define RFC_ULLRAM_BANK1374_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1374_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1375
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1375_DATA_W                                          32
#define RFC_ULLRAM_BANK1375_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1375_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1376
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1376_DATA_W                                          32
#define RFC_ULLRAM_BANK1376_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1376_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1377
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1377_DATA_W                                          32
#define RFC_ULLRAM_BANK1377_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1377_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1378
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1378_DATA_W                                          32
#define RFC_ULLRAM_BANK1378_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1378_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1379
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1379_DATA_W                                          32
#define RFC_ULLRAM_BANK1379_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1379_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1380
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1380_DATA_W                                          32
#define RFC_ULLRAM_BANK1380_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1380_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1381
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1381_DATA_W                                          32
#define RFC_ULLRAM_BANK1381_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1381_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1382
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1382_DATA_W                                          32
#define RFC_ULLRAM_BANK1382_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1382_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1383
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1383_DATA_W                                          32
#define RFC_ULLRAM_BANK1383_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1383_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1384
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1384_DATA_W                                          32
#define RFC_ULLRAM_BANK1384_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1384_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1385
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1385_DATA_W                                          32
#define RFC_ULLRAM_BANK1385_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1385_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1386
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1386_DATA_W                                          32
#define RFC_ULLRAM_BANK1386_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1386_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1387
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1387_DATA_W                                          32
#define RFC_ULLRAM_BANK1387_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1387_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1388
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1388_DATA_W                                          32
#define RFC_ULLRAM_BANK1388_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1388_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1389
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1389_DATA_W                                          32
#define RFC_ULLRAM_BANK1389_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1389_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1390
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1390_DATA_W                                          32
#define RFC_ULLRAM_BANK1390_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1390_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1391
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1391_DATA_W                                          32
#define RFC_ULLRAM_BANK1391_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1391_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1392
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1392_DATA_W                                          32
#define RFC_ULLRAM_BANK1392_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1392_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1393
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1393_DATA_W                                          32
#define RFC_ULLRAM_BANK1393_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1393_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1394
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1394_DATA_W                                          32
#define RFC_ULLRAM_BANK1394_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1394_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1395
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1395_DATA_W                                          32
#define RFC_ULLRAM_BANK1395_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1395_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1396
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1396_DATA_W                                          32
#define RFC_ULLRAM_BANK1396_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1396_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1397
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1397_DATA_W                                          32
#define RFC_ULLRAM_BANK1397_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1397_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1398
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1398_DATA_W                                          32
#define RFC_ULLRAM_BANK1398_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1398_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1399
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1399_DATA_W                                          32
#define RFC_ULLRAM_BANK1399_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1399_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1400
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1400_DATA_W                                          32
#define RFC_ULLRAM_BANK1400_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1400_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1401
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1401_DATA_W                                          32
#define RFC_ULLRAM_BANK1401_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1401_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1402
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1402_DATA_W                                          32
#define RFC_ULLRAM_BANK1402_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1402_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1403
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1403_DATA_W                                          32
#define RFC_ULLRAM_BANK1403_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1403_DATA_S                                           0

