TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1404
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1404_DATA_W                                          32
#define RFC_ULLRAM_BANK1404_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1404_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1405
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1405_DATA_W                                          32
#define RFC_ULLRAM_BANK1405_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1405_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1406
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1406_DATA_W                                          32
#define RFC_ULLRAM_BANK1406_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1406_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1407
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1407_DATA_W                                          32
#define RFC_ULLRAM_BANK1407_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1407_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1408
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1408_DATA_W                                          32
#define RFC_ULLRAM_BANK1408_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1408_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1409
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1409_DATA_W                                          32
#define RFC_ULLRAM_BANK1409_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1409_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1410
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1410_DATA_W                                          32
#define RFC_ULLRAM_BANK1410_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1410_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1411
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1411_DATA_W                                          32
#define RFC_ULLRAM_BANK1411_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1411_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1412
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1412_DATA_W                                          32
#define RFC_ULLRAM_BANK1412_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1412_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1413
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1413_DATA_W                                          32
#define RFC_ULLRAM_BANK1413_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1413_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1414
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1414_DATA_W                                          32
#define RFC_ULLRAM_BANK1414_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1414_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1415
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1415_DATA_W                                          32
#define RFC_ULLRAM_BANK1415_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1415_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1416
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1416_DATA_W                                          32
#define RFC_ULLRAM_BANK1416_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1416_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1417
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1417_DATA_W                                          32
#define RFC_ULLRAM_BANK1417_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1417_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1418
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1418_DATA_W                                          32
#define RFC_ULLRAM_BANK1418_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1418_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1419
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1419_DATA_W                                          32
#define RFC_ULLRAM_BANK1419_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1419_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1420
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1420_DATA_W                                          32
#define RFC_ULLRAM_BANK1420_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1420_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1421
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1421_DATA_W                                          32
#define RFC_ULLRAM_BANK1421_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1421_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1422
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1422_DATA_W                                          32
#define RFC_ULLRAM_BANK1422_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1422_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1423
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1423_DATA_W                                          32
#define RFC_ULLRAM_BANK1423_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1423_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1424
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1424_DATA_W                                          32
#define RFC_ULLRAM_BANK1424_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1424_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1425
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1425_DATA_W                                          32
#define RFC_ULLRAM_BANK1425_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1425_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1426
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1426_DATA_W                                          32
#define RFC_ULLRAM_BANK1426_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1426_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1427
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1427_DATA_W                                          32
#define RFC_ULLRAM_BANK1427_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1427_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1428
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1428_DATA_W                                          32
#define RFC_ULLRAM_BANK1428_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1428_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1429
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1429_DATA_W                                          32
#define RFC_ULLRAM_BANK1429_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1429_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1430
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1430_DATA_W                                          32
#define RFC_ULLRAM_BANK1430_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1430_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1431
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1431_DATA_W                                          32
#define RFC_ULLRAM_BANK1431_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1431_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1432
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1432_DATA_W                                          32
#define RFC_ULLRAM_BANK1432_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1432_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1433
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1433_DATA_W                                          32
#define RFC_ULLRAM_BANK1433_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1433_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1434
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1434_DATA_W                                          32
#define RFC_ULLRAM_BANK1434_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1434_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1435
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1435_DATA_W                                          32
#define RFC_ULLRAM_BANK1435_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1435_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1436
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1436_DATA_W                                          32
#define RFC_ULLRAM_BANK1436_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1436_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1437
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1437_DATA_W                                          32
#define RFC_ULLRAM_BANK1437_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1437_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1438
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1438_DATA_W                                          32
#define RFC_ULLRAM_BANK1438_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1438_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1439
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1439_DATA_W                                          32
#define RFC_ULLRAM_BANK1439_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1439_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1440
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1440_DATA_W                                          32
#define RFC_ULLRAM_BANK1440_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1440_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1441
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1441_DATA_W                                          32
#define RFC_ULLRAM_BANK1441_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1441_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1442
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1442_DATA_W                                          32
#define RFC_ULLRAM_BANK1442_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1442_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1443
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1443_DATA_W                                          32
#define RFC_ULLRAM_BANK1443_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1443_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1444
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1444_DATA_W                                          32
#define RFC_ULLRAM_BANK1444_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1444_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1445
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1445_DATA_W                                          32
#define RFC_ULLRAM_BANK1445_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1445_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1446
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1446_DATA_W                                          32
#define RFC_ULLRAM_BANK1446_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1446_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1447
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1447_DATA_W                                          32
#define RFC_ULLRAM_BANK1447_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1447_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1448
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1448_DATA_W                                          32
#define RFC_ULLRAM_BANK1448_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1448_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1449
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1449_DATA_W                                          32
#define RFC_ULLRAM_BANK1449_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1449_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1450
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1450_DATA_W                                          32
#define RFC_ULLRAM_BANK1450_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1450_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1451
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1451_DATA_W                                          32
#define RFC_ULLRAM_BANK1451_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1451_DATA_S                                           0

