TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1452
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1452_DATA_W                                          32
#define RFC_ULLRAM_BANK1452_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1452_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1453
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1453_DATA_W                                          32
#define RFC_ULLRAM_BANK1453_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1453_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1454
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1454_DATA_W                                          32
#define RFC_ULLRAM_BANK1454_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1454_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1455
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1455_DATA_W                                          32
#define RFC_ULLRAM_BANK1455_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1455_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1456
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1456_DATA_W                                          32
#define RFC_ULLRAM_BANK1456_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1456_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1457
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1457_DATA_W                                          32
#define RFC_ULLRAM_BANK1457_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1457_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1458
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1458_DATA_W                                          32
#define RFC_ULLRAM_BANK1458_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1458_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1459
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1459_DATA_W                                          32
#define RFC_ULLRAM_BANK1459_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1459_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1460
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1460_DATA_W                                          32
#define RFC_ULLRAM_BANK1460_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1460_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1461
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1461_DATA_W                                          32
#define RFC_ULLRAM_BANK1461_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1461_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1462
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1462_DATA_W                                          32
#define RFC_ULLRAM_BANK1462_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1462_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1463
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1463_DATA_W                                          32
#define RFC_ULLRAM_BANK1463_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1463_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1464
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1464_DATA_W                                          32
#define RFC_ULLRAM_BANK1464_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1464_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1465
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1465_DATA_W                                          32
#define RFC_ULLRAM_BANK1465_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1465_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1466
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1466_DATA_W                                          32
#define RFC_ULLRAM_BANK1466_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1466_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1467
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1467_DATA_W                                          32
#define RFC_ULLRAM_BANK1467_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1467_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1468
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1468_DATA_W                                          32
#define RFC_ULLRAM_BANK1468_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1468_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1469
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1469_DATA_W                                          32
#define RFC_ULLRAM_BANK1469_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1469_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1470
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1470_DATA_W                                          32
#define RFC_ULLRAM_BANK1470_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1470_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1471
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1471_DATA_W                                          32
#define RFC_ULLRAM_BANK1471_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1471_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1472
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1472_DATA_W                                          32
#define RFC_ULLRAM_BANK1472_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1472_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1473
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1473_DATA_W                                          32
#define RFC_ULLRAM_BANK1473_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1473_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1474
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1474_DATA_W                                          32
#define RFC_ULLRAM_BANK1474_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1474_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1475
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1475_DATA_W                                          32
#define RFC_ULLRAM_BANK1475_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1475_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1476
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1476_DATA_W                                          32
#define RFC_ULLRAM_BANK1476_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1476_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1477
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1477_DATA_W                                          32
#define RFC_ULLRAM_BANK1477_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1477_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1478
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1478_DATA_W                                          32
#define RFC_ULLRAM_BANK1478_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1478_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1479
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1479_DATA_W                                          32
#define RFC_ULLRAM_BANK1479_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1479_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1480
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1480_DATA_W                                          32
#define RFC_ULLRAM_BANK1480_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1480_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1481
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1481_DATA_W                                          32
#define RFC_ULLRAM_BANK1481_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1481_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1482
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1482_DATA_W                                          32
#define RFC_ULLRAM_BANK1482_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1482_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1483
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1483_DATA_W                                          32
#define RFC_ULLRAM_BANK1483_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1483_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1484
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1484_DATA_W                                          32
#define RFC_ULLRAM_BANK1484_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1484_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1485
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1485_DATA_W                                          32
#define RFC_ULLRAM_BANK1485_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1485_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1486
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1486_DATA_W                                          32
#define RFC_ULLRAM_BANK1486_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1486_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1487
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1487_DATA_W                                          32
#define RFC_ULLRAM_BANK1487_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1487_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1488
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1488_DATA_W                                          32
#define RFC_ULLRAM_BANK1488_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1488_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1489
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1489_DATA_W                                          32
#define RFC_ULLRAM_BANK1489_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1489_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1490
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1490_DATA_W                                          32
#define RFC_ULLRAM_BANK1490_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1490_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1491
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1491_DATA_W                                          32
#define RFC_ULLRAM_BANK1491_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1491_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1492
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1492_DATA_W                                          32
#define RFC_ULLRAM_BANK1492_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1492_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1493
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1493_DATA_W                                          32
#define RFC_ULLRAM_BANK1493_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1493_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1494
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1494_DATA_W                                          32
#define RFC_ULLRAM_BANK1494_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1494_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1495
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1495_DATA_W                                          32
#define RFC_ULLRAM_BANK1495_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1495_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1496
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1496_DATA_W                                          32
#define RFC_ULLRAM_BANK1496_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1496_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1497
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1497_DATA_W                                          32
#define RFC_ULLRAM_BANK1497_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1497_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1498
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1498_DATA_W                                          32
#define RFC_ULLRAM_BANK1498_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1498_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1499
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1499_DATA_W                                          32
#define RFC_ULLRAM_BANK1499_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1499_DATA_S                                           0

