TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1500
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1500_DATA_W                                          32
#define RFC_ULLRAM_BANK1500_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1500_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1501
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1501_DATA_W                                          32
#define RFC_ULLRAM_BANK1501_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1501_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1502
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1502_DATA_W                                          32
#define RFC_ULLRAM_BANK1502_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1502_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1503
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1503_DATA_W                                          32
#define RFC_ULLRAM_BANK1503_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1503_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1504
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1504_DATA_W                                          32
#define RFC_ULLRAM_BANK1504_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1504_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1505
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1505_DATA_W                                          32
#define RFC_ULLRAM_BANK1505_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1505_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1506
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1506_DATA_W                                          32
#define RFC_ULLRAM_BANK1506_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1506_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1507
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1507_DATA_W                                          32
#define RFC_ULLRAM_BANK1507_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1507_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1508
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1508_DATA_W                                          32
#define RFC_ULLRAM_BANK1508_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1508_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1509
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1509_DATA_W                                          32
#define RFC_ULLRAM_BANK1509_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1509_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1510
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1510_DATA_W                                          32
#define RFC_ULLRAM_BANK1510_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1510_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1511
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1511_DATA_W                                          32
#define RFC_ULLRAM_BANK1511_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1511_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1512
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1512_DATA_W                                          32
#define RFC_ULLRAM_BANK1512_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1512_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1513
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1513_DATA_W                                          32
#define RFC_ULLRAM_BANK1513_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1513_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1514
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1514_DATA_W                                          32
#define RFC_ULLRAM_BANK1514_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1514_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1515
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1515_DATA_W                                          32
#define RFC_ULLRAM_BANK1515_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1515_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1516
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1516_DATA_W                                          32
#define RFC_ULLRAM_BANK1516_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1516_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1517
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1517_DATA_W                                          32
#define RFC_ULLRAM_BANK1517_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1517_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1518
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1518_DATA_W                                          32
#define RFC_ULLRAM_BANK1518_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1518_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1519
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1519_DATA_W                                          32
#define RFC_ULLRAM_BANK1519_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1519_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1520
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1520_DATA_W                                          32
#define RFC_ULLRAM_BANK1520_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1520_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1521
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1521_DATA_W                                          32
#define RFC_ULLRAM_BANK1521_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1521_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1522
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1522_DATA_W                                          32
#define RFC_ULLRAM_BANK1522_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1522_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1523
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1523_DATA_W                                          32
#define RFC_ULLRAM_BANK1523_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1523_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1524
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1524_DATA_W                                          32
#define RFC_ULLRAM_BANK1524_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1524_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1525
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1525_DATA_W                                          32
#define RFC_ULLRAM_BANK1525_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1525_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1526
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1526_DATA_W                                          32
#define RFC_ULLRAM_BANK1526_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1526_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1527
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1527_DATA_W                                          32
#define RFC_ULLRAM_BANK1527_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1527_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1528
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1528_DATA_W                                          32
#define RFC_ULLRAM_BANK1528_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1528_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1529
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1529_DATA_W                                          32
#define RFC_ULLRAM_BANK1529_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1529_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1530
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1530_DATA_W                                          32
#define RFC_ULLRAM_BANK1530_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1530_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1531
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1531_DATA_W                                          32
#define RFC_ULLRAM_BANK1531_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1531_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1532
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1532_DATA_W                                          32
#define RFC_ULLRAM_BANK1532_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1532_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1533
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1533_DATA_W                                          32
#define RFC_ULLRAM_BANK1533_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1533_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1534
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1534_DATA_W                                          32
#define RFC_ULLRAM_BANK1534_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1534_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1535
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1535_DATA_W                                          32
#define RFC_ULLRAM_BANK1535_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1535_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1536
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1536_DATA_W                                          32
#define RFC_ULLRAM_BANK1536_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1536_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1537
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1537_DATA_W                                          32
#define RFC_ULLRAM_BANK1537_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1537_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1538
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1538_DATA_W                                          32
#define RFC_ULLRAM_BANK1538_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1538_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1539
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1539_DATA_W                                          32
#define RFC_ULLRAM_BANK1539_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1539_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1540
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1540_DATA_W                                          32
#define RFC_ULLRAM_BANK1540_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1540_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1541
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1541_DATA_W                                          32
#define RFC_ULLRAM_BANK1541_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1541_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1542
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1542_DATA_W                                          32
#define RFC_ULLRAM_BANK1542_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1542_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1543
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1543_DATA_W                                          32
#define RFC_ULLRAM_BANK1543_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1543_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1544
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1544_DATA_W                                          32
#define RFC_ULLRAM_BANK1544_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1544_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1545
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1545_DATA_W                                          32
#define RFC_ULLRAM_BANK1545_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1545_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1546
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1546_DATA_W                                          32
#define RFC_ULLRAM_BANK1546_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1546_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1547
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1547_DATA_W                                          32
#define RFC_ULLRAM_BANK1547_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1547_DATA_S                                           0

