TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1548
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1548_DATA_W                                          32
#define RFC_ULLRAM_BANK1548_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1548_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1549
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1549_DATA_W                                          32
#define RFC_ULLRAM_BANK1549_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1549_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1550
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1550_DATA_W                                          32
#define RFC_ULLRAM_BANK1550_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1550_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1551
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1551_DATA_W                                          32
#define RFC_ULLRAM_BANK1551_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1551_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1552
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1552_DATA_W                                          32
#define RFC_ULLRAM_BANK1552_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1552_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1553
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1553_DATA_W                                          32
#define RFC_ULLRAM_BANK1553_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1553_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1554
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1554_DATA_W                                          32
#define RFC_ULLRAM_BANK1554_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1554_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1555
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1555_DATA_W                                          32
#define RFC_ULLRAM_BANK1555_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1555_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1556
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1556_DATA_W                                          32
#define RFC_ULLRAM_BANK1556_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1556_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1557
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1557_DATA_W                                          32
#define RFC_ULLRAM_BANK1557_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1557_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1558
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1558_DATA_W                                          32
#define RFC_ULLRAM_BANK1558_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1558_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1559
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1559_DATA_W                                          32
#define RFC_ULLRAM_BANK1559_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1559_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1560
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1560_DATA_W                                          32
#define RFC_ULLRAM_BANK1560_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1560_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1561
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1561_DATA_W                                          32
#define RFC_ULLRAM_BANK1561_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1561_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1562
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1562_DATA_W                                          32
#define RFC_ULLRAM_BANK1562_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1562_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1563
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1563_DATA_W                                          32
#define RFC_ULLRAM_BANK1563_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1563_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1564
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1564_DATA_W                                          32
#define RFC_ULLRAM_BANK1564_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1564_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1565
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1565_DATA_W                                          32
#define RFC_ULLRAM_BANK1565_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1565_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1566
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1566_DATA_W                                          32
#define RFC_ULLRAM_BANK1566_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1566_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1567
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1567_DATA_W                                          32
#define RFC_ULLRAM_BANK1567_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1567_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1568
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1568_DATA_W                                          32
#define RFC_ULLRAM_BANK1568_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1568_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1569
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1569_DATA_W                                          32
#define RFC_ULLRAM_BANK1569_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1569_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1570
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1570_DATA_W                                          32
#define RFC_ULLRAM_BANK1570_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1570_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1571
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1571_DATA_W                                          32
#define RFC_ULLRAM_BANK1571_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1571_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1572
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1572_DATA_W                                          32
#define RFC_ULLRAM_BANK1572_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1572_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1573
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1573_DATA_W                                          32
#define RFC_ULLRAM_BANK1573_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1573_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1574
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1574_DATA_W                                          32
#define RFC_ULLRAM_BANK1574_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1574_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1575
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1575_DATA_W                                          32
#define RFC_ULLRAM_BANK1575_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1575_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1576
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1576_DATA_W                                          32
#define RFC_ULLRAM_BANK1576_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1576_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1577
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1577_DATA_W                                          32
#define RFC_ULLRAM_BANK1577_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1577_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1578
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1578_DATA_W                                          32
#define RFC_ULLRAM_BANK1578_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1578_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1579
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1579_DATA_W                                          32
#define RFC_ULLRAM_BANK1579_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1579_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1580
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1580_DATA_W                                          32
#define RFC_ULLRAM_BANK1580_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1580_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1581
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1581_DATA_W                                          32
#define RFC_ULLRAM_BANK1581_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1581_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1582
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1582_DATA_W                                          32
#define RFC_ULLRAM_BANK1582_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1582_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1583
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1583_DATA_W                                          32
#define RFC_ULLRAM_BANK1583_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1583_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1584
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1584_DATA_W                                          32
#define RFC_ULLRAM_BANK1584_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1584_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1585
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1585_DATA_W                                          32
#define RFC_ULLRAM_BANK1585_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1585_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1586
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1586_DATA_W                                          32
#define RFC_ULLRAM_BANK1586_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1586_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1587
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1587_DATA_W                                          32
#define RFC_ULLRAM_BANK1587_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1587_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1588
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1588_DATA_W                                          32
#define RFC_ULLRAM_BANK1588_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1588_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1589
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1589_DATA_W                                          32
#define RFC_ULLRAM_BANK1589_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1589_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1590
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1590_DATA_W                                          32
#define RFC_ULLRAM_BANK1590_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1590_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1591
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1591_DATA_W                                          32
#define RFC_ULLRAM_BANK1591_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1591_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1592
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1592_DATA_W                                          32
#define RFC_ULLRAM_BANK1592_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1592_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1593
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1593_DATA_W                                          32
#define RFC_ULLRAM_BANK1593_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1593_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1594
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1594_DATA_W                                          32
#define RFC_ULLRAM_BANK1594_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1594_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1595
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1595_DATA_W                                          32
#define RFC_ULLRAM_BANK1595_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1595_DATA_S                                           0

