TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1596
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1596_DATA_W                                          32
#define RFC_ULLRAM_BANK1596_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1596_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1597
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1597_DATA_W                                          32
#define RFC_ULLRAM_BANK1597_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1597_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1598
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1598_DATA_W                                          32
#define RFC_ULLRAM_BANK1598_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1598_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1599
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1599_DATA_W                                          32
#define RFC_ULLRAM_BANK1599_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1599_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1600
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1600_DATA_W                                          32
#define RFC_ULLRAM_BANK1600_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1600_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1601
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1601_DATA_W                                          32
#define RFC_ULLRAM_BANK1601_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1601_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1602
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1602_DATA_W                                          32
#define RFC_ULLRAM_BANK1602_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1602_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1603
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1603_DATA_W                                          32
#define RFC_ULLRAM_BANK1603_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1603_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1604
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1604_DATA_W                                          32
#define RFC_ULLRAM_BANK1604_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1604_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1605
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1605_DATA_W                                          32
#define RFC_ULLRAM_BANK1605_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1605_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1606
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1606_DATA_W                                          32
#define RFC_ULLRAM_BANK1606_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1606_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1607
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1607_DATA_W                                          32
#define RFC_ULLRAM_BANK1607_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1607_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1608
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1608_DATA_W                                          32
#define RFC_ULLRAM_BANK1608_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1608_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1609
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1609_DATA_W                                          32
#define RFC_ULLRAM_BANK1609_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1609_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1610
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1610_DATA_W                                          32
#define RFC_ULLRAM_BANK1610_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1610_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1611
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1611_DATA_W                                          32
#define RFC_ULLRAM_BANK1611_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1611_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1612
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1612_DATA_W                                          32
#define RFC_ULLRAM_BANK1612_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1612_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1613
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1613_DATA_W                                          32
#define RFC_ULLRAM_BANK1613_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1613_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1614
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1614_DATA_W                                          32
#define RFC_ULLRAM_BANK1614_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1614_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1615
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1615_DATA_W                                          32
#define RFC_ULLRAM_BANK1615_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1615_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1616
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1616_DATA_W                                          32
#define RFC_ULLRAM_BANK1616_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1616_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1617
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1617_DATA_W                                          32
#define RFC_ULLRAM_BANK1617_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1617_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1618
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1618_DATA_W                                          32
#define RFC_ULLRAM_BANK1618_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1618_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1619
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1619_DATA_W                                          32
#define RFC_ULLRAM_BANK1619_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1619_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1620
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1620_DATA_W                                          32
#define RFC_ULLRAM_BANK1620_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1620_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1621
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1621_DATA_W                                          32
#define RFC_ULLRAM_BANK1621_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1621_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1622
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1622_DATA_W                                          32
#define RFC_ULLRAM_BANK1622_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1622_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1623
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1623_DATA_W                                          32
#define RFC_ULLRAM_BANK1623_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1623_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1624
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1624_DATA_W                                          32
#define RFC_ULLRAM_BANK1624_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1624_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1625
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1625_DATA_W                                          32
#define RFC_ULLRAM_BANK1625_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1625_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1626
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1626_DATA_W                                          32
#define RFC_ULLRAM_BANK1626_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1626_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1627
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1627_DATA_W                                          32
#define RFC_ULLRAM_BANK1627_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1627_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1628
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1628_DATA_W                                          32
#define RFC_ULLRAM_BANK1628_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1628_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1629
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1629_DATA_W                                          32
#define RFC_ULLRAM_BANK1629_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1629_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1630
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1630_DATA_W                                          32
#define RFC_ULLRAM_BANK1630_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1630_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1631
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1631_DATA_W                                          32
#define RFC_ULLRAM_BANK1631_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1631_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1632
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1632_DATA_W                                          32
#define RFC_ULLRAM_BANK1632_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1632_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1633
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1633_DATA_W                                          32
#define RFC_ULLRAM_BANK1633_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1633_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1634
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1634_DATA_W                                          32
#define RFC_ULLRAM_BANK1634_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1634_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1635
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1635_DATA_W                                          32
#define RFC_ULLRAM_BANK1635_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1635_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1636
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1636_DATA_W                                          32
#define RFC_ULLRAM_BANK1636_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1636_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1637
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1637_DATA_W                                          32
#define RFC_ULLRAM_BANK1637_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1637_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1638
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1638_DATA_W                                          32
#define RFC_ULLRAM_BANK1638_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1638_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1639
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1639_DATA_W                                          32
#define RFC_ULLRAM_BANK1639_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1639_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1640
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1640_DATA_W                                          32
#define RFC_ULLRAM_BANK1640_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1640_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1641
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1641_DATA_W                                          32
#define RFC_ULLRAM_BANK1641_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1641_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1642
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1642_DATA_W                                          32
#define RFC_ULLRAM_BANK1642_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1642_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1643
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1643_DATA_W                                          32
#define RFC_ULLRAM_BANK1643_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1643_DATA_S                                           0

