TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1644
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1644_DATA_W                                          32
#define RFC_ULLRAM_BANK1644_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1644_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1645
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1645_DATA_W                                          32
#define RFC_ULLRAM_BANK1645_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1645_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1646
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1646_DATA_W                                          32
#define RFC_ULLRAM_BANK1646_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1646_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1647
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1647_DATA_W                                          32
#define RFC_ULLRAM_BANK1647_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1647_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1648
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1648_DATA_W                                          32
#define RFC_ULLRAM_BANK1648_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1648_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1649
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1649_DATA_W                                          32
#define RFC_ULLRAM_BANK1649_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1649_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1650
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1650_DATA_W                                          32
#define RFC_ULLRAM_BANK1650_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1650_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1651
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1651_DATA_W                                          32
#define RFC_ULLRAM_BANK1651_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1651_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1652
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1652_DATA_W                                          32
#define RFC_ULLRAM_BANK1652_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1652_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1653
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1653_DATA_W                                          32
#define RFC_ULLRAM_BANK1653_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1653_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1654
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1654_DATA_W                                          32
#define RFC_ULLRAM_BANK1654_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1654_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1655
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1655_DATA_W                                          32
#define RFC_ULLRAM_BANK1655_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1655_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1656
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1656_DATA_W                                          32
#define RFC_ULLRAM_BANK1656_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1656_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1657
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1657_DATA_W                                          32
#define RFC_ULLRAM_BANK1657_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1657_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1658
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1658_DATA_W                                          32
#define RFC_ULLRAM_BANK1658_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1658_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1659
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1659_DATA_W                                          32
#define RFC_ULLRAM_BANK1659_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1659_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1660
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1660_DATA_W                                          32
#define RFC_ULLRAM_BANK1660_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1660_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1661
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1661_DATA_W                                          32
#define RFC_ULLRAM_BANK1661_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1661_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1662
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1662_DATA_W                                          32
#define RFC_ULLRAM_BANK1662_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1662_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1663
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1663_DATA_W                                          32
#define RFC_ULLRAM_BANK1663_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1663_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1664
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1664_DATA_W                                          32
#define RFC_ULLRAM_BANK1664_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1664_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1665
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1665_DATA_W                                          32
#define RFC_ULLRAM_BANK1665_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1665_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1666
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1666_DATA_W                                          32
#define RFC_ULLRAM_BANK1666_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1666_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1667
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1667_DATA_W                                          32
#define RFC_ULLRAM_BANK1667_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1667_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1668
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1668_DATA_W                                          32
#define RFC_ULLRAM_BANK1668_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1668_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1669
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1669_DATA_W                                          32
#define RFC_ULLRAM_BANK1669_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1669_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1670
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1670_DATA_W                                          32
#define RFC_ULLRAM_BANK1670_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1670_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1671
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1671_DATA_W                                          32
#define RFC_ULLRAM_BANK1671_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1671_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1672
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1672_DATA_W                                          32
#define RFC_ULLRAM_BANK1672_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1672_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1673
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1673_DATA_W                                          32
#define RFC_ULLRAM_BANK1673_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1673_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1674
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1674_DATA_W                                          32
#define RFC_ULLRAM_BANK1674_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1674_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1675
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1675_DATA_W                                          32
#define RFC_ULLRAM_BANK1675_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1675_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1676
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1676_DATA_W                                          32
#define RFC_ULLRAM_BANK1676_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1676_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1677
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1677_DATA_W                                          32
#define RFC_ULLRAM_BANK1677_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1677_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1678
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1678_DATA_W                                          32
#define RFC_ULLRAM_BANK1678_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1678_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1679
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1679_DATA_W                                          32
#define RFC_ULLRAM_BANK1679_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1679_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1680
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1680_DATA_W                                          32
#define RFC_ULLRAM_BANK1680_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1680_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1681
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1681_DATA_W                                          32
#define RFC_ULLRAM_BANK1681_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1681_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1682
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1682_DATA_W                                          32
#define RFC_ULLRAM_BANK1682_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1682_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1683
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1683_DATA_W                                          32
#define RFC_ULLRAM_BANK1683_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1683_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1684
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1684_DATA_W                                          32
#define RFC_ULLRAM_BANK1684_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1684_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1685
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1685_DATA_W                                          32
#define RFC_ULLRAM_BANK1685_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1685_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1686
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1686_DATA_W                                          32
#define RFC_ULLRAM_BANK1686_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1686_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1687
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1687_DATA_W                                          32
#define RFC_ULLRAM_BANK1687_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1687_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1688
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1688_DATA_W                                          32
#define RFC_ULLRAM_BANK1688_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1688_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1689
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1689_DATA_W                                          32
#define RFC_ULLRAM_BANK1689_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1689_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1690
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1690_DATA_W                                          32
#define RFC_ULLRAM_BANK1690_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1690_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1691
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1691_DATA_W                                          32
#define RFC_ULLRAM_BANK1691_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1691_DATA_S                                           0

