TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1740
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1740_DATA_W                                          32
#define RFC_ULLRAM_BANK1740_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1740_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1741
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1741_DATA_W                                          32
#define RFC_ULLRAM_BANK1741_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1741_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1742
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1742_DATA_W                                          32
#define RFC_ULLRAM_BANK1742_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1742_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1743
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1743_DATA_W                                          32
#define RFC_ULLRAM_BANK1743_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1743_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1744
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1744_DATA_W                                          32
#define RFC_ULLRAM_BANK1744_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1744_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1745
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1745_DATA_W                                          32
#define RFC_ULLRAM_BANK1745_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1745_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1746
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1746_DATA_W                                          32
#define RFC_ULLRAM_BANK1746_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1746_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1747
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1747_DATA_W                                          32
#define RFC_ULLRAM_BANK1747_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1747_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1748
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1748_DATA_W                                          32
#define RFC_ULLRAM_BANK1748_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1748_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1749
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1749_DATA_W                                          32
#define RFC_ULLRAM_BANK1749_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1749_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1750
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1750_DATA_W                                          32
#define RFC_ULLRAM_BANK1750_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1750_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1751
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1751_DATA_W                                          32
#define RFC_ULLRAM_BANK1751_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1751_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1752
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1752_DATA_W                                          32
#define RFC_ULLRAM_BANK1752_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1752_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1753
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1753_DATA_W                                          32
#define RFC_ULLRAM_BANK1753_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1753_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1754
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1754_DATA_W                                          32
#define RFC_ULLRAM_BANK1754_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1754_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1755
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1755_DATA_W                                          32
#define RFC_ULLRAM_BANK1755_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1755_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1756
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1756_DATA_W                                          32
#define RFC_ULLRAM_BANK1756_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1756_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1757
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1757_DATA_W                                          32
#define RFC_ULLRAM_BANK1757_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1757_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1758
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1758_DATA_W                                          32
#define RFC_ULLRAM_BANK1758_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1758_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1759
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1759_DATA_W                                          32
#define RFC_ULLRAM_BANK1759_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1759_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1760
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1760_DATA_W                                          32
#define RFC_ULLRAM_BANK1760_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1760_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1761
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1761_DATA_W                                          32
#define RFC_ULLRAM_BANK1761_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1761_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1762
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1762_DATA_W                                          32
#define RFC_ULLRAM_BANK1762_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1762_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1763
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1763_DATA_W                                          32
#define RFC_ULLRAM_BANK1763_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1763_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1764
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1764_DATA_W                                          32
#define RFC_ULLRAM_BANK1764_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1764_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1765
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1765_DATA_W                                          32
#define RFC_ULLRAM_BANK1765_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1765_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1766
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1766_DATA_W                                          32
#define RFC_ULLRAM_BANK1766_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1766_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1767
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1767_DATA_W                                          32
#define RFC_ULLRAM_BANK1767_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1767_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1768
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1768_DATA_W                                          32
#define RFC_ULLRAM_BANK1768_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1768_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1769
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1769_DATA_W                                          32
#define RFC_ULLRAM_BANK1769_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1769_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1770
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1770_DATA_W                                          32
#define RFC_ULLRAM_BANK1770_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1770_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1771
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1771_DATA_W                                          32
#define RFC_ULLRAM_BANK1771_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1771_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1772
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1772_DATA_W                                          32
#define RFC_ULLRAM_BANK1772_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1772_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1773
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1773_DATA_W                                          32
#define RFC_ULLRAM_BANK1773_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1773_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1774
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1774_DATA_W                                          32
#define RFC_ULLRAM_BANK1774_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1774_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1775
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1775_DATA_W                                          32
#define RFC_ULLRAM_BANK1775_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1775_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1776
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1776_DATA_W                                          32
#define RFC_ULLRAM_BANK1776_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1776_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1777
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1777_DATA_W                                          32
#define RFC_ULLRAM_BANK1777_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1777_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1778
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1778_DATA_W                                          32
#define RFC_ULLRAM_BANK1778_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1778_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1779
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1779_DATA_W                                          32
#define RFC_ULLRAM_BANK1779_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1779_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1780
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1780_DATA_W                                          32
#define RFC_ULLRAM_BANK1780_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1780_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1781
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1781_DATA_W                                          32
#define RFC_ULLRAM_BANK1781_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1781_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1782
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1782_DATA_W                                          32
#define RFC_ULLRAM_BANK1782_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1782_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1783
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1783_DATA_W                                          32
#define RFC_ULLRAM_BANK1783_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1783_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1784
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1784_DATA_W                                          32
#define RFC_ULLRAM_BANK1784_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1784_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1785
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1785_DATA_W                                          32
#define RFC_ULLRAM_BANK1785_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1785_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1786
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1786_DATA_W                                          32
#define RFC_ULLRAM_BANK1786_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1786_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1787
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1787_DATA_W                                          32
#define RFC_ULLRAM_BANK1787_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1787_DATA_S                                           0

