TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1788
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1788_DATA_W                                          32
#define RFC_ULLRAM_BANK1788_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1788_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1789
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1789_DATA_W                                          32
#define RFC_ULLRAM_BANK1789_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1789_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1790
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1790_DATA_W                                          32
#define RFC_ULLRAM_BANK1790_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1790_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1791
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1791_DATA_W                                          32
#define RFC_ULLRAM_BANK1791_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1791_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1792
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1792_DATA_W                                          32
#define RFC_ULLRAM_BANK1792_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1792_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1793
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1793_DATA_W                                          32
#define RFC_ULLRAM_BANK1793_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1793_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1794
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1794_DATA_W                                          32
#define RFC_ULLRAM_BANK1794_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1794_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1795
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1795_DATA_W                                          32
#define RFC_ULLRAM_BANK1795_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1795_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1796
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1796_DATA_W                                          32
#define RFC_ULLRAM_BANK1796_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1796_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1797
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1797_DATA_W                                          32
#define RFC_ULLRAM_BANK1797_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1797_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1798
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1798_DATA_W                                          32
#define RFC_ULLRAM_BANK1798_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1798_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1799
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1799_DATA_W                                          32
#define RFC_ULLRAM_BANK1799_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1799_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1800
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1800_DATA_W                                          32
#define RFC_ULLRAM_BANK1800_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1800_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1801
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1801_DATA_W                                          32
#define RFC_ULLRAM_BANK1801_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1801_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1802
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1802_DATA_W                                          32
#define RFC_ULLRAM_BANK1802_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1802_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1803
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1803_DATA_W                                          32
#define RFC_ULLRAM_BANK1803_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1803_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1804
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1804_DATA_W                                          32
#define RFC_ULLRAM_BANK1804_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1804_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1805
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1805_DATA_W                                          32
#define RFC_ULLRAM_BANK1805_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1805_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1806
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1806_DATA_W                                          32
#define RFC_ULLRAM_BANK1806_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1806_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1807
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1807_DATA_W                                          32
#define RFC_ULLRAM_BANK1807_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1807_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1808
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1808_DATA_W                                          32
#define RFC_ULLRAM_BANK1808_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1808_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1809
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1809_DATA_W                                          32
#define RFC_ULLRAM_BANK1809_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1809_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1810
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1810_DATA_W                                          32
#define RFC_ULLRAM_BANK1810_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1810_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1811
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1811_DATA_W                                          32
#define RFC_ULLRAM_BANK1811_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1811_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1812
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1812_DATA_W                                          32
#define RFC_ULLRAM_BANK1812_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1812_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1813
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1813_DATA_W                                          32
#define RFC_ULLRAM_BANK1813_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1813_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1814
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1814_DATA_W                                          32
#define RFC_ULLRAM_BANK1814_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1814_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1815
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1815_DATA_W                                          32
#define RFC_ULLRAM_BANK1815_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1815_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1816
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1816_DATA_W                                          32
#define RFC_ULLRAM_BANK1816_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1816_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1817
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1817_DATA_W                                          32
#define RFC_ULLRAM_BANK1817_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1817_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1818
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1818_DATA_W                                          32
#define RFC_ULLRAM_BANK1818_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1818_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1819
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1819_DATA_W                                          32
#define RFC_ULLRAM_BANK1819_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1819_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1820
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1820_DATA_W                                          32
#define RFC_ULLRAM_BANK1820_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1820_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1821
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1821_DATA_W                                          32
#define RFC_ULLRAM_BANK1821_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1821_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1822
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1822_DATA_W                                          32
#define RFC_ULLRAM_BANK1822_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1822_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1823
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1823_DATA_W                                          32
#define RFC_ULLRAM_BANK1823_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1823_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1824
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1824_DATA_W                                          32
#define RFC_ULLRAM_BANK1824_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1824_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1825
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1825_DATA_W                                          32
#define RFC_ULLRAM_BANK1825_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1825_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1826
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1826_DATA_W                                          32
#define RFC_ULLRAM_BANK1826_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1826_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1827
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1827_DATA_W                                          32
#define RFC_ULLRAM_BANK1827_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1827_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1828
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1828_DATA_W                                          32
#define RFC_ULLRAM_BANK1828_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1828_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1829
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1829_DATA_W                                          32
#define RFC_ULLRAM_BANK1829_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1829_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1830
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1830_DATA_W                                          32
#define RFC_ULLRAM_BANK1830_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1830_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1831
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1831_DATA_W                                          32
#define RFC_ULLRAM_BANK1831_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1831_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1832
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1832_DATA_W                                          32
#define RFC_ULLRAM_BANK1832_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1832_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1833
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1833_DATA_W                                          32
#define RFC_ULLRAM_BANK1833_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1833_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1834
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1834_DATA_W                                          32
#define RFC_ULLRAM_BANK1834_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1834_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1835
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1835_DATA_W                                          32
#define RFC_ULLRAM_BANK1835_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1835_DATA_S                                           0

