TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1980
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1980_DATA_W                                          32
#define RFC_ULLRAM_BANK1980_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1980_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1981
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1981_DATA_W                                          32
#define RFC_ULLRAM_BANK1981_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1981_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1982
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1982_DATA_W                                          32
#define RFC_ULLRAM_BANK1982_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1982_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1983
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1983_DATA_W                                          32
#define RFC_ULLRAM_BANK1983_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1983_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1984
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1984_DATA_W                                          32
#define RFC_ULLRAM_BANK1984_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1984_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1985
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1985_DATA_W                                          32
#define RFC_ULLRAM_BANK1985_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1985_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1986
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1986_DATA_W                                          32
#define RFC_ULLRAM_BANK1986_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1986_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1987
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1987_DATA_W                                          32
#define RFC_ULLRAM_BANK1987_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1987_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1988
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1988_DATA_W                                          32
#define RFC_ULLRAM_BANK1988_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1988_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1989
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1989_DATA_W                                          32
#define RFC_ULLRAM_BANK1989_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1989_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1990
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1990_DATA_W                                          32
#define RFC_ULLRAM_BANK1990_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1990_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1991
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1991_DATA_W                                          32
#define RFC_ULLRAM_BANK1991_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1991_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1992
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1992_DATA_W                                          32
#define RFC_ULLRAM_BANK1992_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1992_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1993
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1993_DATA_W                                          32
#define RFC_ULLRAM_BANK1993_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1993_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1994
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1994_DATA_W                                          32
#define RFC_ULLRAM_BANK1994_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1994_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1995
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1995_DATA_W                                          32
#define RFC_ULLRAM_BANK1995_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1995_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1996
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1996_DATA_W                                          32
#define RFC_ULLRAM_BANK1996_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1996_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1997
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1997_DATA_W                                          32
#define RFC_ULLRAM_BANK1997_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1997_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1998
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1998_DATA_W                                          32
#define RFC_ULLRAM_BANK1998_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1998_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1999
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1999_DATA_W                                          32
#define RFC_ULLRAM_BANK1999_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1999_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11000
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11000_DATA_W                                         32
#define RFC_ULLRAM_BANK11000_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11000_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11001
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11001_DATA_W                                         32
#define RFC_ULLRAM_BANK11001_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11001_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11002
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11002_DATA_W                                         32
#define RFC_ULLRAM_BANK11002_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11002_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11003
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11003_DATA_W                                         32
#define RFC_ULLRAM_BANK11003_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11003_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11004
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11004_DATA_W                                         32
#define RFC_ULLRAM_BANK11004_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11004_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11005
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11005_DATA_W                                         32
#define RFC_ULLRAM_BANK11005_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11005_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11006
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11006_DATA_W                                         32
#define RFC_ULLRAM_BANK11006_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11006_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11007
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11007_DATA_W                                         32
#define RFC_ULLRAM_BANK11007_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11007_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11008
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11008_DATA_W                                         32
#define RFC_ULLRAM_BANK11008_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11008_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11009
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11009_DATA_W                                         32
#define RFC_ULLRAM_BANK11009_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11009_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11010
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11010_DATA_W                                         32
#define RFC_ULLRAM_BANK11010_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11010_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11011
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11011_DATA_W                                         32
#define RFC_ULLRAM_BANK11011_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11011_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11012
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11012_DATA_W                                         32
#define RFC_ULLRAM_BANK11012_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11012_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11013
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11013_DATA_W                                         32
#define RFC_ULLRAM_BANK11013_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11013_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11014
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11014_DATA_W                                         32
#define RFC_ULLRAM_BANK11014_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11014_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11015
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11015_DATA_W                                         32
#define RFC_ULLRAM_BANK11015_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11015_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11016
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11016_DATA_W                                         32
#define RFC_ULLRAM_BANK11016_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11016_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11017
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11017_DATA_W                                         32
#define RFC_ULLRAM_BANK11017_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11017_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11018
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11018_DATA_W                                         32
#define RFC_ULLRAM_BANK11018_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11018_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11019
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11019_DATA_W                                         32
#define RFC_ULLRAM_BANK11019_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11019_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11020
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11020_DATA_W                                         32
#define RFC_ULLRAM_BANK11020_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11020_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11021
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11021_DATA_W                                         32
#define RFC_ULLRAM_BANK11021_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11021_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11022
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11022_DATA_W                                         32
#define RFC_ULLRAM_BANK11022_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11022_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11023
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11023_DATA_W                                         32
#define RFC_ULLRAM_BANK11023_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11023_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11024
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11024_DATA_W                                         32
#define RFC_ULLRAM_BANK11024_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11024_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11025
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11025_DATA_W                                         32
#define RFC_ULLRAM_BANK11025_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11025_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11026
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11026_DATA_W                                         32
#define RFC_ULLRAM_BANK11026_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11026_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11027
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11027_DATA_W                                         32
#define RFC_ULLRAM_BANK11027_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11027_DATA_S                                          0

