TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11028
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11028_DATA_W                                         32
#define RFC_ULLRAM_BANK11028_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11028_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11029
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11029_DATA_W                                         32
#define RFC_ULLRAM_BANK11029_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11029_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11030
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11030_DATA_W                                         32
#define RFC_ULLRAM_BANK11030_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11030_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11031
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11031_DATA_W                                         32
#define RFC_ULLRAM_BANK11031_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11031_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11032
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11032_DATA_W                                         32
#define RFC_ULLRAM_BANK11032_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11032_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11033
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11033_DATA_W                                         32
#define RFC_ULLRAM_BANK11033_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11033_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11034
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11034_DATA_W                                         32
#define RFC_ULLRAM_BANK11034_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11034_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11035
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11035_DATA_W                                         32
#define RFC_ULLRAM_BANK11035_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11035_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11036
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11036_DATA_W                                         32
#define RFC_ULLRAM_BANK11036_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11036_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11037
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11037_DATA_W                                         32
#define RFC_ULLRAM_BANK11037_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11037_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11038
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11038_DATA_W                                         32
#define RFC_ULLRAM_BANK11038_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11038_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11039
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11039_DATA_W                                         32
#define RFC_ULLRAM_BANK11039_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11039_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11040
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11040_DATA_W                                         32
#define RFC_ULLRAM_BANK11040_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11040_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11041
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11041_DATA_W                                         32
#define RFC_ULLRAM_BANK11041_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11041_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11042
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11042_DATA_W                                         32
#define RFC_ULLRAM_BANK11042_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11042_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11043
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11043_DATA_W                                         32
#define RFC_ULLRAM_BANK11043_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11043_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11044
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11044_DATA_W                                         32
#define RFC_ULLRAM_BANK11044_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11044_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11045
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11045_DATA_W                                         32
#define RFC_ULLRAM_BANK11045_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11045_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11046
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11046_DATA_W                                         32
#define RFC_ULLRAM_BANK11046_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11046_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11047
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11047_DATA_W                                         32
#define RFC_ULLRAM_BANK11047_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11047_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11048
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11048_DATA_W                                         32
#define RFC_ULLRAM_BANK11048_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11048_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11049
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11049_DATA_W                                         32
#define RFC_ULLRAM_BANK11049_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11049_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11050
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11050_DATA_W                                         32
#define RFC_ULLRAM_BANK11050_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11050_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11051
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11051_DATA_W                                         32
#define RFC_ULLRAM_BANK11051_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11051_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11052
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11052_DATA_W                                         32
#define RFC_ULLRAM_BANK11052_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11052_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11053
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11053_DATA_W                                         32
#define RFC_ULLRAM_BANK11053_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11053_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11054
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11054_DATA_W                                         32
#define RFC_ULLRAM_BANK11054_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11054_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11055
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11055_DATA_W                                         32
#define RFC_ULLRAM_BANK11055_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11055_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11056
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11056_DATA_W                                         32
#define RFC_ULLRAM_BANK11056_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11056_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11057
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11057_DATA_W                                         32
#define RFC_ULLRAM_BANK11057_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11057_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11058
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11058_DATA_W                                         32
#define RFC_ULLRAM_BANK11058_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11058_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11059
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11059_DATA_W                                         32
#define RFC_ULLRAM_BANK11059_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11059_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11060
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11060_DATA_W                                         32
#define RFC_ULLRAM_BANK11060_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11060_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11061
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11061_DATA_W                                         32
#define RFC_ULLRAM_BANK11061_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11061_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11062
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11062_DATA_W                                         32
#define RFC_ULLRAM_BANK11062_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11062_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11063
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11063_DATA_W                                         32
#define RFC_ULLRAM_BANK11063_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11063_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11064
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11064_DATA_W                                         32
#define RFC_ULLRAM_BANK11064_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11064_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11065
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11065_DATA_W                                         32
#define RFC_ULLRAM_BANK11065_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11065_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11066
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11066_DATA_W                                         32
#define RFC_ULLRAM_BANK11066_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11066_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11067
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11067_DATA_W                                         32
#define RFC_ULLRAM_BANK11067_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11067_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11068
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11068_DATA_W                                         32
#define RFC_ULLRAM_BANK11068_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11068_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11069
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11069_DATA_W                                         32
#define RFC_ULLRAM_BANK11069_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11069_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11070
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11070_DATA_W                                         32
#define RFC_ULLRAM_BANK11070_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11070_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11071
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11071_DATA_W                                         32
#define RFC_ULLRAM_BANK11071_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11071_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11072
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11072_DATA_W                                         32
#define RFC_ULLRAM_BANK11072_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11072_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11073
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11073_DATA_W                                         32
#define RFC_ULLRAM_BANK11073_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11073_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11074
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11074_DATA_W                                         32
#define RFC_ULLRAM_BANK11074_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11074_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11075
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11075_DATA_W                                         32
#define RFC_ULLRAM_BANK11075_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11075_DATA_S                                          0

