TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11076
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11076_DATA_W                                         32
#define RFC_ULLRAM_BANK11076_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11076_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11077
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11077_DATA_W                                         32
#define RFC_ULLRAM_BANK11077_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11077_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11078
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11078_DATA_W                                         32
#define RFC_ULLRAM_BANK11078_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11078_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11079
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11079_DATA_W                                         32
#define RFC_ULLRAM_BANK11079_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11079_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11080
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11080_DATA_W                                         32
#define RFC_ULLRAM_BANK11080_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11080_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11081
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11081_DATA_W                                         32
#define RFC_ULLRAM_BANK11081_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11081_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11082
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11082_DATA_W                                         32
#define RFC_ULLRAM_BANK11082_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11082_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11083
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11083_DATA_W                                         32
#define RFC_ULLRAM_BANK11083_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11083_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11084
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11084_DATA_W                                         32
#define RFC_ULLRAM_BANK11084_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11084_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11085
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11085_DATA_W                                         32
#define RFC_ULLRAM_BANK11085_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11085_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11086
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11086_DATA_W                                         32
#define RFC_ULLRAM_BANK11086_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11086_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11087
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11087_DATA_W                                         32
#define RFC_ULLRAM_BANK11087_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11087_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11088
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11088_DATA_W                                         32
#define RFC_ULLRAM_BANK11088_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11088_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11089
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11089_DATA_W                                         32
#define RFC_ULLRAM_BANK11089_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11089_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11090
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11090_DATA_W                                         32
#define RFC_ULLRAM_BANK11090_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11090_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11091
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11091_DATA_W                                         32
#define RFC_ULLRAM_BANK11091_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11091_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11092
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11092_DATA_W                                         32
#define RFC_ULLRAM_BANK11092_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11092_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11093
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11093_DATA_W                                         32
#define RFC_ULLRAM_BANK11093_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11093_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11094
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11094_DATA_W                                         32
#define RFC_ULLRAM_BANK11094_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11094_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11095
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11095_DATA_W                                         32
#define RFC_ULLRAM_BANK11095_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11095_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11096
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11096_DATA_W                                         32
#define RFC_ULLRAM_BANK11096_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11096_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11097
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11097_DATA_W                                         32
#define RFC_ULLRAM_BANK11097_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11097_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11098
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11098_DATA_W                                         32
#define RFC_ULLRAM_BANK11098_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11098_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11099
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11099_DATA_W                                         32
#define RFC_ULLRAM_BANK11099_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11099_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11100
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11100_DATA_W                                         32
#define RFC_ULLRAM_BANK11100_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11100_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11101
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11101_DATA_W                                         32
#define RFC_ULLRAM_BANK11101_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11101_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11102
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11102_DATA_W                                         32
#define RFC_ULLRAM_BANK11102_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11102_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11103
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11103_DATA_W                                         32
#define RFC_ULLRAM_BANK11103_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11103_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11104
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11104_DATA_W                                         32
#define RFC_ULLRAM_BANK11104_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11104_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11105
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11105_DATA_W                                         32
#define RFC_ULLRAM_BANK11105_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11105_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11106
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11106_DATA_W                                         32
#define RFC_ULLRAM_BANK11106_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11106_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11107
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11107_DATA_W                                         32
#define RFC_ULLRAM_BANK11107_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11107_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11108
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11108_DATA_W                                         32
#define RFC_ULLRAM_BANK11108_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11108_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11109
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11109_DATA_W                                         32
#define RFC_ULLRAM_BANK11109_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11109_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11110
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11110_DATA_W                                         32
#define RFC_ULLRAM_BANK11110_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11110_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11111
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11111_DATA_W                                         32
#define RFC_ULLRAM_BANK11111_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11111_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11112
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11112_DATA_W                                         32
#define RFC_ULLRAM_BANK11112_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11112_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11113
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11113_DATA_W                                         32
#define RFC_ULLRAM_BANK11113_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11113_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11114
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11114_DATA_W                                         32
#define RFC_ULLRAM_BANK11114_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11114_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11115
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11115_DATA_W                                         32
#define RFC_ULLRAM_BANK11115_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11115_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11116
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11116_DATA_W                                         32
#define RFC_ULLRAM_BANK11116_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11116_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11117
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11117_DATA_W                                         32
#define RFC_ULLRAM_BANK11117_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11117_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11118
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11118_DATA_W                                         32
#define RFC_ULLRAM_BANK11118_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11118_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11119
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11119_DATA_W                                         32
#define RFC_ULLRAM_BANK11119_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11119_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11120
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11120_DATA_W                                         32
#define RFC_ULLRAM_BANK11120_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11120_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11121
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11121_DATA_W                                         32
#define RFC_ULLRAM_BANK11121_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11121_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11122
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11122_DATA_W                                         32
#define RFC_ULLRAM_BANK11122_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11122_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11123
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11123_DATA_W                                         32
#define RFC_ULLRAM_BANK11123_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11123_DATA_S                                          0

