TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11172
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11172_DATA_W                                         32
#define RFC_ULLRAM_BANK11172_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11172_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11173
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11173_DATA_W                                         32
#define RFC_ULLRAM_BANK11173_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11173_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11174
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11174_DATA_W                                         32
#define RFC_ULLRAM_BANK11174_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11174_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11175
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11175_DATA_W                                         32
#define RFC_ULLRAM_BANK11175_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11175_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11176
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11176_DATA_W                                         32
#define RFC_ULLRAM_BANK11176_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11176_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11177
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11177_DATA_W                                         32
#define RFC_ULLRAM_BANK11177_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11177_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11178
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11178_DATA_W                                         32
#define RFC_ULLRAM_BANK11178_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11178_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11179
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11179_DATA_W                                         32
#define RFC_ULLRAM_BANK11179_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11179_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11180
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11180_DATA_W                                         32
#define RFC_ULLRAM_BANK11180_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11180_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11181
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11181_DATA_W                                         32
#define RFC_ULLRAM_BANK11181_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11181_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11182
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11182_DATA_W                                         32
#define RFC_ULLRAM_BANK11182_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11182_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11183
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11183_DATA_W                                         32
#define RFC_ULLRAM_BANK11183_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11183_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11184
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11184_DATA_W                                         32
#define RFC_ULLRAM_BANK11184_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11184_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11185
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11185_DATA_W                                         32
#define RFC_ULLRAM_BANK11185_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11185_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11186
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11186_DATA_W                                         32
#define RFC_ULLRAM_BANK11186_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11186_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11187
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11187_DATA_W                                         32
#define RFC_ULLRAM_BANK11187_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11187_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11188
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11188_DATA_W                                         32
#define RFC_ULLRAM_BANK11188_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11188_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11189
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11189_DATA_W                                         32
#define RFC_ULLRAM_BANK11189_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11189_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11190
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11190_DATA_W                                         32
#define RFC_ULLRAM_BANK11190_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11190_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11191
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11191_DATA_W                                         32
#define RFC_ULLRAM_BANK11191_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11191_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11192
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11192_DATA_W                                         32
#define RFC_ULLRAM_BANK11192_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11192_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11193
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11193_DATA_W                                         32
#define RFC_ULLRAM_BANK11193_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11193_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11194
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11194_DATA_W                                         32
#define RFC_ULLRAM_BANK11194_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11194_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11195
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11195_DATA_W                                         32
#define RFC_ULLRAM_BANK11195_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11195_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11196
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11196_DATA_W                                         32
#define RFC_ULLRAM_BANK11196_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11196_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11197
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11197_DATA_W                                         32
#define RFC_ULLRAM_BANK11197_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11197_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11198
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11198_DATA_W                                         32
#define RFC_ULLRAM_BANK11198_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11198_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11199
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11199_DATA_W                                         32
#define RFC_ULLRAM_BANK11199_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11199_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11200
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11200_DATA_W                                         32
#define RFC_ULLRAM_BANK11200_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11200_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11201
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11201_DATA_W                                         32
#define RFC_ULLRAM_BANK11201_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11201_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11202
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11202_DATA_W                                         32
#define RFC_ULLRAM_BANK11202_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11202_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11203
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11203_DATA_W                                         32
#define RFC_ULLRAM_BANK11203_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11203_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11204
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11204_DATA_W                                         32
#define RFC_ULLRAM_BANK11204_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11204_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11205
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11205_DATA_W                                         32
#define RFC_ULLRAM_BANK11205_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11205_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11206
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11206_DATA_W                                         32
#define RFC_ULLRAM_BANK11206_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11206_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11207
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11207_DATA_W                                         32
#define RFC_ULLRAM_BANK11207_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11207_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11208
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11208_DATA_W                                         32
#define RFC_ULLRAM_BANK11208_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11208_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11209
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11209_DATA_W                                         32
#define RFC_ULLRAM_BANK11209_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11209_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11210
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11210_DATA_W                                         32
#define RFC_ULLRAM_BANK11210_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11210_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11211
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11211_DATA_W                                         32
#define RFC_ULLRAM_BANK11211_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11211_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11212
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11212_DATA_W                                         32
#define RFC_ULLRAM_BANK11212_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11212_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11213
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11213_DATA_W                                         32
#define RFC_ULLRAM_BANK11213_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11213_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11214
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11214_DATA_W                                         32
#define RFC_ULLRAM_BANK11214_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11214_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11215
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11215_DATA_W                                         32
#define RFC_ULLRAM_BANK11215_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11215_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11216
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11216_DATA_W                                         32
#define RFC_ULLRAM_BANK11216_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11216_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11217
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11217_DATA_W                                         32
#define RFC_ULLRAM_BANK11217_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11217_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11218
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11218_DATA_W                                         32
#define RFC_ULLRAM_BANK11218_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11218_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11219
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11219_DATA_W                                         32
#define RFC_ULLRAM_BANK11219_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11219_DATA_S                                          0

