TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11268
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11268_DATA_W                                         32
#define RFC_ULLRAM_BANK11268_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11268_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11269
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11269_DATA_W                                         32
#define RFC_ULLRAM_BANK11269_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11269_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11270
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11270_DATA_W                                         32
#define RFC_ULLRAM_BANK11270_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11270_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11271
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11271_DATA_W                                         32
#define RFC_ULLRAM_BANK11271_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11271_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11272
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11272_DATA_W                                         32
#define RFC_ULLRAM_BANK11272_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11272_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11273
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11273_DATA_W                                         32
#define RFC_ULLRAM_BANK11273_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11273_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11274
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11274_DATA_W                                         32
#define RFC_ULLRAM_BANK11274_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11274_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11275
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11275_DATA_W                                         32
#define RFC_ULLRAM_BANK11275_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11275_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11276
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11276_DATA_W                                         32
#define RFC_ULLRAM_BANK11276_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11276_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11277
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11277_DATA_W                                         32
#define RFC_ULLRAM_BANK11277_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11277_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11278
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11278_DATA_W                                         32
#define RFC_ULLRAM_BANK11278_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11278_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11279
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11279_DATA_W                                         32
#define RFC_ULLRAM_BANK11279_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11279_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11280
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11280_DATA_W                                         32
#define RFC_ULLRAM_BANK11280_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11280_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11281
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11281_DATA_W                                         32
#define RFC_ULLRAM_BANK11281_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11281_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11282
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11282_DATA_W                                         32
#define RFC_ULLRAM_BANK11282_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11282_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11283
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11283_DATA_W                                         32
#define RFC_ULLRAM_BANK11283_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11283_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11284
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11284_DATA_W                                         32
#define RFC_ULLRAM_BANK11284_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11284_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11285
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11285_DATA_W                                         32
#define RFC_ULLRAM_BANK11285_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11285_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11286
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11286_DATA_W                                         32
#define RFC_ULLRAM_BANK11286_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11286_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11287
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11287_DATA_W                                         32
#define RFC_ULLRAM_BANK11287_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11287_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11288
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11288_DATA_W                                         32
#define RFC_ULLRAM_BANK11288_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11288_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11289
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11289_DATA_W                                         32
#define RFC_ULLRAM_BANK11289_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11289_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11290
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11290_DATA_W                                         32
#define RFC_ULLRAM_BANK11290_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11290_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11291
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11291_DATA_W                                         32
#define RFC_ULLRAM_BANK11291_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11291_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11292
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11292_DATA_W                                         32
#define RFC_ULLRAM_BANK11292_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11292_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11293
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11293_DATA_W                                         32
#define RFC_ULLRAM_BANK11293_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11293_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11294
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11294_DATA_W                                         32
#define RFC_ULLRAM_BANK11294_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11294_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11295
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11295_DATA_W                                         32
#define RFC_ULLRAM_BANK11295_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11295_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11296
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11296_DATA_W                                         32
#define RFC_ULLRAM_BANK11296_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11296_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11297
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11297_DATA_W                                         32
#define RFC_ULLRAM_BANK11297_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11297_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11298
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11298_DATA_W                                         32
#define RFC_ULLRAM_BANK11298_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11298_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11299
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11299_DATA_W                                         32
#define RFC_ULLRAM_BANK11299_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11299_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11300
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11300_DATA_W                                         32
#define RFC_ULLRAM_BANK11300_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11300_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11301
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11301_DATA_W                                         32
#define RFC_ULLRAM_BANK11301_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11301_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11302
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11302_DATA_W                                         32
#define RFC_ULLRAM_BANK11302_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11302_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11303
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11303_DATA_W                                         32
#define RFC_ULLRAM_BANK11303_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11303_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11304
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11304_DATA_W                                         32
#define RFC_ULLRAM_BANK11304_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11304_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11305
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11305_DATA_W                                         32
#define RFC_ULLRAM_BANK11305_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11305_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11306
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11306_DATA_W                                         32
#define RFC_ULLRAM_BANK11306_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11306_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11307
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11307_DATA_W                                         32
#define RFC_ULLRAM_BANK11307_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11307_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11308
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11308_DATA_W                                         32
#define RFC_ULLRAM_BANK11308_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11308_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11309
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11309_DATA_W                                         32
#define RFC_ULLRAM_BANK11309_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11309_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11310
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11310_DATA_W                                         32
#define RFC_ULLRAM_BANK11310_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11310_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11311
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11311_DATA_W                                         32
#define RFC_ULLRAM_BANK11311_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11311_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11312
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11312_DATA_W                                         32
#define RFC_ULLRAM_BANK11312_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11312_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11313
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11313_DATA_W                                         32
#define RFC_ULLRAM_BANK11313_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11313_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11314
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11314_DATA_W                                         32
#define RFC_ULLRAM_BANK11314_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11314_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11315
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11315_DATA_W                                         32
#define RFC_ULLRAM_BANK11315_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11315_DATA_S                                          0

