TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11316
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11316_DATA_W                                         32
#define RFC_ULLRAM_BANK11316_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11316_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11317
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11317_DATA_W                                         32
#define RFC_ULLRAM_BANK11317_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11317_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11318
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11318_DATA_W                                         32
#define RFC_ULLRAM_BANK11318_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11318_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11319
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11319_DATA_W                                         32
#define RFC_ULLRAM_BANK11319_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11319_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11320
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11320_DATA_W                                         32
#define RFC_ULLRAM_BANK11320_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11320_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11321
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11321_DATA_W                                         32
#define RFC_ULLRAM_BANK11321_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11321_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11322
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11322_DATA_W                                         32
#define RFC_ULLRAM_BANK11322_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11322_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11323
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11323_DATA_W                                         32
#define RFC_ULLRAM_BANK11323_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11323_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11324
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11324_DATA_W                                         32
#define RFC_ULLRAM_BANK11324_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11324_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11325
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11325_DATA_W                                         32
#define RFC_ULLRAM_BANK11325_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11325_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11326
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11326_DATA_W                                         32
#define RFC_ULLRAM_BANK11326_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11326_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11327
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11327_DATA_W                                         32
#define RFC_ULLRAM_BANK11327_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11327_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11328
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11328_DATA_W                                         32
#define RFC_ULLRAM_BANK11328_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11328_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11329
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11329_DATA_W                                         32
#define RFC_ULLRAM_BANK11329_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11329_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11330
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11330_DATA_W                                         32
#define RFC_ULLRAM_BANK11330_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11330_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11331
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11331_DATA_W                                         32
#define RFC_ULLRAM_BANK11331_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11331_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11332
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11332_DATA_W                                         32
#define RFC_ULLRAM_BANK11332_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11332_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11333
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11333_DATA_W                                         32
#define RFC_ULLRAM_BANK11333_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11333_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11334
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11334_DATA_W                                         32
#define RFC_ULLRAM_BANK11334_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11334_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11335
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11335_DATA_W                                         32
#define RFC_ULLRAM_BANK11335_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11335_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11336
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11336_DATA_W                                         32
#define RFC_ULLRAM_BANK11336_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11336_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11337
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11337_DATA_W                                         32
#define RFC_ULLRAM_BANK11337_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11337_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11338
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11338_DATA_W                                         32
#define RFC_ULLRAM_BANK11338_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11338_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11339
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11339_DATA_W                                         32
#define RFC_ULLRAM_BANK11339_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11339_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11340
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11340_DATA_W                                         32
#define RFC_ULLRAM_BANK11340_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11340_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11341
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11341_DATA_W                                         32
#define RFC_ULLRAM_BANK11341_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11341_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11342
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11342_DATA_W                                         32
#define RFC_ULLRAM_BANK11342_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11342_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11343
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11343_DATA_W                                         32
#define RFC_ULLRAM_BANK11343_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11343_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11344
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11344_DATA_W                                         32
#define RFC_ULLRAM_BANK11344_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11344_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11345
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11345_DATA_W                                         32
#define RFC_ULLRAM_BANK11345_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11345_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11346
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11346_DATA_W                                         32
#define RFC_ULLRAM_BANK11346_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11346_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11347
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11347_DATA_W                                         32
#define RFC_ULLRAM_BANK11347_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11347_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11348
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11348_DATA_W                                         32
#define RFC_ULLRAM_BANK11348_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11348_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11349
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11349_DATA_W                                         32
#define RFC_ULLRAM_BANK11349_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11349_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11350
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11350_DATA_W                                         32
#define RFC_ULLRAM_BANK11350_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11350_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11351
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11351_DATA_W                                         32
#define RFC_ULLRAM_BANK11351_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11351_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11352
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11352_DATA_W                                         32
#define RFC_ULLRAM_BANK11352_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11352_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11353
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11353_DATA_W                                         32
#define RFC_ULLRAM_BANK11353_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11353_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11354
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11354_DATA_W                                         32
#define RFC_ULLRAM_BANK11354_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11354_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11355
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11355_DATA_W                                         32
#define RFC_ULLRAM_BANK11355_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11355_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11356
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11356_DATA_W                                         32
#define RFC_ULLRAM_BANK11356_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11356_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11357
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11357_DATA_W                                         32
#define RFC_ULLRAM_BANK11357_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11357_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11358
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11358_DATA_W                                         32
#define RFC_ULLRAM_BANK11358_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11358_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11359
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11359_DATA_W                                         32
#define RFC_ULLRAM_BANK11359_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11359_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11360
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11360_DATA_W                                         32
#define RFC_ULLRAM_BANK11360_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11360_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11361
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11361_DATA_W                                         32
#define RFC_ULLRAM_BANK11361_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11361_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11362
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11362_DATA_W                                         32
#define RFC_ULLRAM_BANK11362_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11362_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11363
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11363_DATA_W                                         32
#define RFC_ULLRAM_BANK11363_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11363_DATA_S                                          0

