TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11364
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11364_DATA_W                                         32
#define RFC_ULLRAM_BANK11364_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11364_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11365
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11365_DATA_W                                         32
#define RFC_ULLRAM_BANK11365_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11365_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11366
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11366_DATA_W                                         32
#define RFC_ULLRAM_BANK11366_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11366_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11367
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11367_DATA_W                                         32
#define RFC_ULLRAM_BANK11367_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11367_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11368
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11368_DATA_W                                         32
#define RFC_ULLRAM_BANK11368_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11368_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11369
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11369_DATA_W                                         32
#define RFC_ULLRAM_BANK11369_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11369_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11370
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11370_DATA_W                                         32
#define RFC_ULLRAM_BANK11370_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11370_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11371
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11371_DATA_W                                         32
#define RFC_ULLRAM_BANK11371_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11371_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11372
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11372_DATA_W                                         32
#define RFC_ULLRAM_BANK11372_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11372_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11373
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11373_DATA_W                                         32
#define RFC_ULLRAM_BANK11373_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11373_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11374
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11374_DATA_W                                         32
#define RFC_ULLRAM_BANK11374_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11374_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11375
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11375_DATA_W                                         32
#define RFC_ULLRAM_BANK11375_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11375_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11376
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11376_DATA_W                                         32
#define RFC_ULLRAM_BANK11376_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11376_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11377
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11377_DATA_W                                         32
#define RFC_ULLRAM_BANK11377_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11377_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11378
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11378_DATA_W                                         32
#define RFC_ULLRAM_BANK11378_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11378_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11379
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11379_DATA_W                                         32
#define RFC_ULLRAM_BANK11379_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11379_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11380
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11380_DATA_W                                         32
#define RFC_ULLRAM_BANK11380_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11380_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11381
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11381_DATA_W                                         32
#define RFC_ULLRAM_BANK11381_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11381_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11382
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11382_DATA_W                                         32
#define RFC_ULLRAM_BANK11382_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11382_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11383
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11383_DATA_W                                         32
#define RFC_ULLRAM_BANK11383_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11383_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11384
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11384_DATA_W                                         32
#define RFC_ULLRAM_BANK11384_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11384_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11385
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11385_DATA_W                                         32
#define RFC_ULLRAM_BANK11385_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11385_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11386
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11386_DATA_W                                         32
#define RFC_ULLRAM_BANK11386_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11386_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11387
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11387_DATA_W                                         32
#define RFC_ULLRAM_BANK11387_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11387_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11388
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11388_DATA_W                                         32
#define RFC_ULLRAM_BANK11388_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11388_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11389
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11389_DATA_W                                         32
#define RFC_ULLRAM_BANK11389_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11389_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11390
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11390_DATA_W                                         32
#define RFC_ULLRAM_BANK11390_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11390_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11391
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11391_DATA_W                                         32
#define RFC_ULLRAM_BANK11391_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11391_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11392
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11392_DATA_W                                         32
#define RFC_ULLRAM_BANK11392_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11392_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11393
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11393_DATA_W                                         32
#define RFC_ULLRAM_BANK11393_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11393_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11394
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11394_DATA_W                                         32
#define RFC_ULLRAM_BANK11394_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11394_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11395
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11395_DATA_W                                         32
#define RFC_ULLRAM_BANK11395_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11395_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11396
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11396_DATA_W                                         32
#define RFC_ULLRAM_BANK11396_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11396_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11397
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11397_DATA_W                                         32
#define RFC_ULLRAM_BANK11397_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11397_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11398
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11398_DATA_W                                         32
#define RFC_ULLRAM_BANK11398_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11398_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11399
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11399_DATA_W                                         32
#define RFC_ULLRAM_BANK11399_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11399_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11400
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11400_DATA_W                                         32
#define RFC_ULLRAM_BANK11400_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11400_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11401
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11401_DATA_W                                         32
#define RFC_ULLRAM_BANK11401_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11401_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11402
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11402_DATA_W                                         32
#define RFC_ULLRAM_BANK11402_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11402_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11403
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11403_DATA_W                                         32
#define RFC_ULLRAM_BANK11403_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11403_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11404
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11404_DATA_W                                         32
#define RFC_ULLRAM_BANK11404_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11404_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11405
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11405_DATA_W                                         32
#define RFC_ULLRAM_BANK11405_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11405_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11406
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11406_DATA_W                                         32
#define RFC_ULLRAM_BANK11406_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11406_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11407
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11407_DATA_W                                         32
#define RFC_ULLRAM_BANK11407_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11407_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11408
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11408_DATA_W                                         32
#define RFC_ULLRAM_BANK11408_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11408_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11409
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11409_DATA_W                                         32
#define RFC_ULLRAM_BANK11409_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11409_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11410
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11410_DATA_W                                         32
#define RFC_ULLRAM_BANK11410_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11410_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11411
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11411_DATA_W                                         32
#define RFC_ULLRAM_BANK11411_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11411_DATA_S                                          0

