TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11412
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11412_DATA_W                                         32
#define RFC_ULLRAM_BANK11412_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11412_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11413
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11413_DATA_W                                         32
#define RFC_ULLRAM_BANK11413_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11413_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11414
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11414_DATA_W                                         32
#define RFC_ULLRAM_BANK11414_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11414_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11415
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11415_DATA_W                                         32
#define RFC_ULLRAM_BANK11415_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11415_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11416
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11416_DATA_W                                         32
#define RFC_ULLRAM_BANK11416_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11416_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11417
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11417_DATA_W                                         32
#define RFC_ULLRAM_BANK11417_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11417_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11418
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11418_DATA_W                                         32
#define RFC_ULLRAM_BANK11418_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11418_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11419
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11419_DATA_W                                         32
#define RFC_ULLRAM_BANK11419_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11419_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11420
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11420_DATA_W                                         32
#define RFC_ULLRAM_BANK11420_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11420_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11421
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11421_DATA_W                                         32
#define RFC_ULLRAM_BANK11421_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11421_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11422
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11422_DATA_W                                         32
#define RFC_ULLRAM_BANK11422_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11422_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11423
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11423_DATA_W                                         32
#define RFC_ULLRAM_BANK11423_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11423_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11424
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11424_DATA_W                                         32
#define RFC_ULLRAM_BANK11424_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11424_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11425
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11425_DATA_W                                         32
#define RFC_ULLRAM_BANK11425_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11425_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11426
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11426_DATA_W                                         32
#define RFC_ULLRAM_BANK11426_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11426_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11427
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11427_DATA_W                                         32
#define RFC_ULLRAM_BANK11427_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11427_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11428
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11428_DATA_W                                         32
#define RFC_ULLRAM_BANK11428_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11428_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11429
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11429_DATA_W                                         32
#define RFC_ULLRAM_BANK11429_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11429_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11430
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11430_DATA_W                                         32
#define RFC_ULLRAM_BANK11430_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11430_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11431
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11431_DATA_W                                         32
#define RFC_ULLRAM_BANK11431_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11431_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11432
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11432_DATA_W                                         32
#define RFC_ULLRAM_BANK11432_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11432_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11433
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11433_DATA_W                                         32
#define RFC_ULLRAM_BANK11433_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11433_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11434
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11434_DATA_W                                         32
#define RFC_ULLRAM_BANK11434_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11434_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11435
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11435_DATA_W                                         32
#define RFC_ULLRAM_BANK11435_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11435_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11436
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11436_DATA_W                                         32
#define RFC_ULLRAM_BANK11436_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11436_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11437
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11437_DATA_W                                         32
#define RFC_ULLRAM_BANK11437_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11437_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11438
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11438_DATA_W                                         32
#define RFC_ULLRAM_BANK11438_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11438_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11439
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11439_DATA_W                                         32
#define RFC_ULLRAM_BANK11439_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11439_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11440
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11440_DATA_W                                         32
#define RFC_ULLRAM_BANK11440_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11440_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11441
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11441_DATA_W                                         32
#define RFC_ULLRAM_BANK11441_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11441_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11442
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11442_DATA_W                                         32
#define RFC_ULLRAM_BANK11442_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11442_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11443
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11443_DATA_W                                         32
#define RFC_ULLRAM_BANK11443_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11443_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11444
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11444_DATA_W                                         32
#define RFC_ULLRAM_BANK11444_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11444_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11445
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11445_DATA_W                                         32
#define RFC_ULLRAM_BANK11445_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11445_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11446
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11446_DATA_W                                         32
#define RFC_ULLRAM_BANK11446_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11446_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11447
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11447_DATA_W                                         32
#define RFC_ULLRAM_BANK11447_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11447_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11448
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11448_DATA_W                                         32
#define RFC_ULLRAM_BANK11448_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11448_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11449
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11449_DATA_W                                         32
#define RFC_ULLRAM_BANK11449_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11449_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11450
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11450_DATA_W                                         32
#define RFC_ULLRAM_BANK11450_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11450_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11451
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11451_DATA_W                                         32
#define RFC_ULLRAM_BANK11451_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11451_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11452
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11452_DATA_W                                         32
#define RFC_ULLRAM_BANK11452_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11452_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11453
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11453_DATA_W                                         32
#define RFC_ULLRAM_BANK11453_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11453_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11454
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11454_DATA_W                                         32
#define RFC_ULLRAM_BANK11454_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11454_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11455
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11455_DATA_W                                         32
#define RFC_ULLRAM_BANK11455_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11455_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11456
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11456_DATA_W                                         32
#define RFC_ULLRAM_BANK11456_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11456_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11457
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11457_DATA_W                                         32
#define RFC_ULLRAM_BANK11457_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11457_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11458
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11458_DATA_W                                         32
#define RFC_ULLRAM_BANK11458_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11458_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11459
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11459_DATA_W                                         32
#define RFC_ULLRAM_BANK11459_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11459_DATA_S                                          0

