TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11460
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11460_DATA_W                                         32
#define RFC_ULLRAM_BANK11460_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11460_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11461
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11461_DATA_W                                         32
#define RFC_ULLRAM_BANK11461_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11461_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11462
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11462_DATA_W                                         32
#define RFC_ULLRAM_BANK11462_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11462_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11463
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11463_DATA_W                                         32
#define RFC_ULLRAM_BANK11463_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11463_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11464
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11464_DATA_W                                         32
#define RFC_ULLRAM_BANK11464_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11464_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11465
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11465_DATA_W                                         32
#define RFC_ULLRAM_BANK11465_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11465_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11466
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11466_DATA_W                                         32
#define RFC_ULLRAM_BANK11466_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11466_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11467
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11467_DATA_W                                         32
#define RFC_ULLRAM_BANK11467_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11467_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11468
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11468_DATA_W                                         32
#define RFC_ULLRAM_BANK11468_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11468_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11469
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11469_DATA_W                                         32
#define RFC_ULLRAM_BANK11469_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11469_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11470
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11470_DATA_W                                         32
#define RFC_ULLRAM_BANK11470_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11470_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11471
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11471_DATA_W                                         32
#define RFC_ULLRAM_BANK11471_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11471_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11472
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11472_DATA_W                                         32
#define RFC_ULLRAM_BANK11472_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11472_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11473
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11473_DATA_W                                         32
#define RFC_ULLRAM_BANK11473_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11473_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11474
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11474_DATA_W                                         32
#define RFC_ULLRAM_BANK11474_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11474_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11475
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11475_DATA_W                                         32
#define RFC_ULLRAM_BANK11475_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11475_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11476
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11476_DATA_W                                         32
#define RFC_ULLRAM_BANK11476_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11476_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11477
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11477_DATA_W                                         32
#define RFC_ULLRAM_BANK11477_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11477_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11478
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11478_DATA_W                                         32
#define RFC_ULLRAM_BANK11478_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11478_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11479
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11479_DATA_W                                         32
#define RFC_ULLRAM_BANK11479_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11479_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11480
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11480_DATA_W                                         32
#define RFC_ULLRAM_BANK11480_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11480_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11481
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11481_DATA_W                                         32
#define RFC_ULLRAM_BANK11481_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11481_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11482
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11482_DATA_W                                         32
#define RFC_ULLRAM_BANK11482_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11482_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11483
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11483_DATA_W                                         32
#define RFC_ULLRAM_BANK11483_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11483_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11484
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11484_DATA_W                                         32
#define RFC_ULLRAM_BANK11484_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11484_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11485
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11485_DATA_W                                         32
#define RFC_ULLRAM_BANK11485_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11485_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11486
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11486_DATA_W                                         32
#define RFC_ULLRAM_BANK11486_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11486_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11487
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11487_DATA_W                                         32
#define RFC_ULLRAM_BANK11487_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11487_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11488
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11488_DATA_W                                         32
#define RFC_ULLRAM_BANK11488_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11488_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11489
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11489_DATA_W                                         32
#define RFC_ULLRAM_BANK11489_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11489_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11490
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11490_DATA_W                                         32
#define RFC_ULLRAM_BANK11490_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11490_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11491
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11491_DATA_W                                         32
#define RFC_ULLRAM_BANK11491_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11491_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11492
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11492_DATA_W                                         32
#define RFC_ULLRAM_BANK11492_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11492_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11493
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11493_DATA_W                                         32
#define RFC_ULLRAM_BANK11493_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11493_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11494
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11494_DATA_W                                         32
#define RFC_ULLRAM_BANK11494_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11494_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11495
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11495_DATA_W                                         32
#define RFC_ULLRAM_BANK11495_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11495_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11496
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11496_DATA_W                                         32
#define RFC_ULLRAM_BANK11496_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11496_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11497
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11497_DATA_W                                         32
#define RFC_ULLRAM_BANK11497_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11497_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11498
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11498_DATA_W                                         32
#define RFC_ULLRAM_BANK11498_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11498_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11499
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11499_DATA_W                                         32
#define RFC_ULLRAM_BANK11499_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11499_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11500
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11500_DATA_W                                         32
#define RFC_ULLRAM_BANK11500_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11500_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11501
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11501_DATA_W                                         32
#define RFC_ULLRAM_BANK11501_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11501_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11502
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11502_DATA_W                                         32
#define RFC_ULLRAM_BANK11502_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11502_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11503
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11503_DATA_W                                         32
#define RFC_ULLRAM_BANK11503_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11503_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11504
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11504_DATA_W                                         32
#define RFC_ULLRAM_BANK11504_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11504_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11505
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11505_DATA_W                                         32
#define RFC_ULLRAM_BANK11505_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11505_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11506
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11506_DATA_W                                         32
#define RFC_ULLRAM_BANK11506_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11506_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11507
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11507_DATA_W                                         32
#define RFC_ULLRAM_BANK11507_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11507_DATA_S                                          0

