TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11508
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11508_DATA_W                                         32
#define RFC_ULLRAM_BANK11508_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11508_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11509
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11509_DATA_W                                         32
#define RFC_ULLRAM_BANK11509_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11509_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11510
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11510_DATA_W                                         32
#define RFC_ULLRAM_BANK11510_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11510_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11511
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11511_DATA_W                                         32
#define RFC_ULLRAM_BANK11511_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11511_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11512
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11512_DATA_W                                         32
#define RFC_ULLRAM_BANK11512_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11512_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11513
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11513_DATA_W                                         32
#define RFC_ULLRAM_BANK11513_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11513_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11514
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11514_DATA_W                                         32
#define RFC_ULLRAM_BANK11514_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11514_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11515
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11515_DATA_W                                         32
#define RFC_ULLRAM_BANK11515_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11515_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11516
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11516_DATA_W                                         32
#define RFC_ULLRAM_BANK11516_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11516_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11517
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11517_DATA_W                                         32
#define RFC_ULLRAM_BANK11517_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11517_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11518
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11518_DATA_W                                         32
#define RFC_ULLRAM_BANK11518_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11518_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11519
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11519_DATA_W                                         32
#define RFC_ULLRAM_BANK11519_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11519_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11520
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11520_DATA_W                                         32
#define RFC_ULLRAM_BANK11520_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11520_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11521
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11521_DATA_W                                         32
#define RFC_ULLRAM_BANK11521_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11521_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11522
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11522_DATA_W                                         32
#define RFC_ULLRAM_BANK11522_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11522_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11523
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11523_DATA_W                                         32
#define RFC_ULLRAM_BANK11523_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11523_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11524
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11524_DATA_W                                         32
#define RFC_ULLRAM_BANK11524_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11524_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11525
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11525_DATA_W                                         32
#define RFC_ULLRAM_BANK11525_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11525_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11526
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11526_DATA_W                                         32
#define RFC_ULLRAM_BANK11526_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11526_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11527
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11527_DATA_W                                         32
#define RFC_ULLRAM_BANK11527_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11527_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11528
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11528_DATA_W                                         32
#define RFC_ULLRAM_BANK11528_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11528_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11529
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11529_DATA_W                                         32
#define RFC_ULLRAM_BANK11529_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11529_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11530
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11530_DATA_W                                         32
#define RFC_ULLRAM_BANK11530_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11530_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11531
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11531_DATA_W                                         32
#define RFC_ULLRAM_BANK11531_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11531_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11532
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11532_DATA_W                                         32
#define RFC_ULLRAM_BANK11532_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11532_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11533
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11533_DATA_W                                         32
#define RFC_ULLRAM_BANK11533_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11533_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11534
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11534_DATA_W                                         32
#define RFC_ULLRAM_BANK11534_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11534_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11535
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11535_DATA_W                                         32
#define RFC_ULLRAM_BANK11535_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11535_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11536
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11536_DATA_W                                         32
#define RFC_ULLRAM_BANK11536_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11536_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11537
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11537_DATA_W                                         32
#define RFC_ULLRAM_BANK11537_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11537_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11538
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11538_DATA_W                                         32
#define RFC_ULLRAM_BANK11538_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11538_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11539
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11539_DATA_W                                         32
#define RFC_ULLRAM_BANK11539_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11539_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11540
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11540_DATA_W                                         32
#define RFC_ULLRAM_BANK11540_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11540_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11541
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11541_DATA_W                                         32
#define RFC_ULLRAM_BANK11541_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11541_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11542
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11542_DATA_W                                         32
#define RFC_ULLRAM_BANK11542_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11542_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11543
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11543_DATA_W                                         32
#define RFC_ULLRAM_BANK11543_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11543_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11544
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11544_DATA_W                                         32
#define RFC_ULLRAM_BANK11544_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11544_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11545
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11545_DATA_W                                         32
#define RFC_ULLRAM_BANK11545_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11545_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11546
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11546_DATA_W                                         32
#define RFC_ULLRAM_BANK11546_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11546_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11547
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11547_DATA_W                                         32
#define RFC_ULLRAM_BANK11547_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11547_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11548
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11548_DATA_W                                         32
#define RFC_ULLRAM_BANK11548_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11548_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11549
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11549_DATA_W                                         32
#define RFC_ULLRAM_BANK11549_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11549_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11550
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11550_DATA_W                                         32
#define RFC_ULLRAM_BANK11550_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11550_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11551
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11551_DATA_W                                         32
#define RFC_ULLRAM_BANK11551_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11551_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11552
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11552_DATA_W                                         32
#define RFC_ULLRAM_BANK11552_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11552_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11553
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11553_DATA_W                                         32
#define RFC_ULLRAM_BANK11553_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11553_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11554
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11554_DATA_W                                         32
#define RFC_ULLRAM_BANK11554_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11554_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11555
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11555_DATA_W                                         32
#define RFC_ULLRAM_BANK11555_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11555_DATA_S                                          0

