TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11556
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11556_DATA_W                                         32
#define RFC_ULLRAM_BANK11556_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11556_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11557
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11557_DATA_W                                         32
#define RFC_ULLRAM_BANK11557_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11557_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11558
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11558_DATA_W                                         32
#define RFC_ULLRAM_BANK11558_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11558_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11559
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11559_DATA_W                                         32
#define RFC_ULLRAM_BANK11559_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11559_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11560
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11560_DATA_W                                         32
#define RFC_ULLRAM_BANK11560_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11560_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11561
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11561_DATA_W                                         32
#define RFC_ULLRAM_BANK11561_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11561_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11562
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11562_DATA_W                                         32
#define RFC_ULLRAM_BANK11562_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11562_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11563
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11563_DATA_W                                         32
#define RFC_ULLRAM_BANK11563_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11563_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11564
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11564_DATA_W                                         32
#define RFC_ULLRAM_BANK11564_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11564_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11565
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11565_DATA_W                                         32
#define RFC_ULLRAM_BANK11565_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11565_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11566
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11566_DATA_W                                         32
#define RFC_ULLRAM_BANK11566_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11566_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11567
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11567_DATA_W                                         32
#define RFC_ULLRAM_BANK11567_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11567_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11568
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11568_DATA_W                                         32
#define RFC_ULLRAM_BANK11568_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11568_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11569
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11569_DATA_W                                         32
#define RFC_ULLRAM_BANK11569_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11569_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11570
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11570_DATA_W                                         32
#define RFC_ULLRAM_BANK11570_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11570_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11571
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11571_DATA_W                                         32
#define RFC_ULLRAM_BANK11571_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11571_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11572
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11572_DATA_W                                         32
#define RFC_ULLRAM_BANK11572_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11572_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11573
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11573_DATA_W                                         32
#define RFC_ULLRAM_BANK11573_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11573_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11574
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11574_DATA_W                                         32
#define RFC_ULLRAM_BANK11574_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11574_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11575
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11575_DATA_W                                         32
#define RFC_ULLRAM_BANK11575_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11575_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11576
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11576_DATA_W                                         32
#define RFC_ULLRAM_BANK11576_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11576_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11577
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11577_DATA_W                                         32
#define RFC_ULLRAM_BANK11577_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11577_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11578
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11578_DATA_W                                         32
#define RFC_ULLRAM_BANK11578_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11578_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11579
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11579_DATA_W                                         32
#define RFC_ULLRAM_BANK11579_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11579_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11580
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11580_DATA_W                                         32
#define RFC_ULLRAM_BANK11580_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11580_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11581
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11581_DATA_W                                         32
#define RFC_ULLRAM_BANK11581_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11581_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11582
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11582_DATA_W                                         32
#define RFC_ULLRAM_BANK11582_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11582_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11583
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11583_DATA_W                                         32
#define RFC_ULLRAM_BANK11583_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11583_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11584
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11584_DATA_W                                         32
#define RFC_ULLRAM_BANK11584_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11584_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11585
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11585_DATA_W                                         32
#define RFC_ULLRAM_BANK11585_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11585_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11586
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11586_DATA_W                                         32
#define RFC_ULLRAM_BANK11586_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11586_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11587
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11587_DATA_W                                         32
#define RFC_ULLRAM_BANK11587_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11587_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11588
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11588_DATA_W                                         32
#define RFC_ULLRAM_BANK11588_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11588_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11589
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11589_DATA_W                                         32
#define RFC_ULLRAM_BANK11589_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11589_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11590
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11590_DATA_W                                         32
#define RFC_ULLRAM_BANK11590_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11590_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11591
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11591_DATA_W                                         32
#define RFC_ULLRAM_BANK11591_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11591_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11592
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11592_DATA_W                                         32
#define RFC_ULLRAM_BANK11592_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11592_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11593
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11593_DATA_W                                         32
#define RFC_ULLRAM_BANK11593_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11593_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11594
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11594_DATA_W                                         32
#define RFC_ULLRAM_BANK11594_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11594_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11595
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11595_DATA_W                                         32
#define RFC_ULLRAM_BANK11595_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11595_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11596
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11596_DATA_W                                         32
#define RFC_ULLRAM_BANK11596_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11596_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11597
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11597_DATA_W                                         32
#define RFC_ULLRAM_BANK11597_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11597_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11598
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11598_DATA_W                                         32
#define RFC_ULLRAM_BANK11598_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11598_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11599
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11599_DATA_W                                         32
#define RFC_ULLRAM_BANK11599_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11599_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11600
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11600_DATA_W                                         32
#define RFC_ULLRAM_BANK11600_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11600_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11601
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11601_DATA_W                                         32
#define RFC_ULLRAM_BANK11601_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11601_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11602
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11602_DATA_W                                         32
#define RFC_ULLRAM_BANK11602_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11602_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11603
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11603_DATA_W                                         32
#define RFC_ULLRAM_BANK11603_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11603_DATA_S                                          0

