TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11604
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11604_DATA_W                                         32
#define RFC_ULLRAM_BANK11604_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11604_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11605
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11605_DATA_W                                         32
#define RFC_ULLRAM_BANK11605_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11605_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11606
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11606_DATA_W                                         32
#define RFC_ULLRAM_BANK11606_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11606_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11607
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11607_DATA_W                                         32
#define RFC_ULLRAM_BANK11607_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11607_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11608
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11608_DATA_W                                         32
#define RFC_ULLRAM_BANK11608_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11608_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11609
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11609_DATA_W                                         32
#define RFC_ULLRAM_BANK11609_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11609_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11610
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11610_DATA_W                                         32
#define RFC_ULLRAM_BANK11610_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11610_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11611
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11611_DATA_W                                         32
#define RFC_ULLRAM_BANK11611_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11611_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11612
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11612_DATA_W                                         32
#define RFC_ULLRAM_BANK11612_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11612_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11613
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11613_DATA_W                                         32
#define RFC_ULLRAM_BANK11613_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11613_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11614
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11614_DATA_W                                         32
#define RFC_ULLRAM_BANK11614_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11614_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11615
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11615_DATA_W                                         32
#define RFC_ULLRAM_BANK11615_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11615_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11616
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11616_DATA_W                                         32
#define RFC_ULLRAM_BANK11616_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11616_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11617
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11617_DATA_W                                         32
#define RFC_ULLRAM_BANK11617_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11617_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11618
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11618_DATA_W                                         32
#define RFC_ULLRAM_BANK11618_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11618_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11619
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11619_DATA_W                                         32
#define RFC_ULLRAM_BANK11619_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11619_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11620
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11620_DATA_W                                         32
#define RFC_ULLRAM_BANK11620_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11620_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11621
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11621_DATA_W                                         32
#define RFC_ULLRAM_BANK11621_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11621_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11622
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11622_DATA_W                                         32
#define RFC_ULLRAM_BANK11622_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11622_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11623
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11623_DATA_W                                         32
#define RFC_ULLRAM_BANK11623_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11623_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11624
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11624_DATA_W                                         32
#define RFC_ULLRAM_BANK11624_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11624_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11625
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11625_DATA_W                                         32
#define RFC_ULLRAM_BANK11625_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11625_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11626
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11626_DATA_W                                         32
#define RFC_ULLRAM_BANK11626_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11626_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11627
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11627_DATA_W                                         32
#define RFC_ULLRAM_BANK11627_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11627_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11628
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11628_DATA_W                                         32
#define RFC_ULLRAM_BANK11628_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11628_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11629
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11629_DATA_W                                         32
#define RFC_ULLRAM_BANK11629_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11629_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11630
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11630_DATA_W                                         32
#define RFC_ULLRAM_BANK11630_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11630_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11631
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11631_DATA_W                                         32
#define RFC_ULLRAM_BANK11631_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11631_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11632
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11632_DATA_W                                         32
#define RFC_ULLRAM_BANK11632_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11632_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11633
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11633_DATA_W                                         32
#define RFC_ULLRAM_BANK11633_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11633_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11634
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11634_DATA_W                                         32
#define RFC_ULLRAM_BANK11634_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11634_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11635
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11635_DATA_W                                         32
#define RFC_ULLRAM_BANK11635_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11635_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11636
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11636_DATA_W                                         32
#define RFC_ULLRAM_BANK11636_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11636_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11637
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11637_DATA_W                                         32
#define RFC_ULLRAM_BANK11637_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11637_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11638
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11638_DATA_W                                         32
#define RFC_ULLRAM_BANK11638_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11638_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11639
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11639_DATA_W                                         32
#define RFC_ULLRAM_BANK11639_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11639_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11640
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11640_DATA_W                                         32
#define RFC_ULLRAM_BANK11640_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11640_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11641
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11641_DATA_W                                         32
#define RFC_ULLRAM_BANK11641_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11641_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11642
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11642_DATA_W                                         32
#define RFC_ULLRAM_BANK11642_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11642_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11643
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11643_DATA_W                                         32
#define RFC_ULLRAM_BANK11643_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11643_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11644
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11644_DATA_W                                         32
#define RFC_ULLRAM_BANK11644_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11644_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11645
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11645_DATA_W                                         32
#define RFC_ULLRAM_BANK11645_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11645_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11646
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11646_DATA_W                                         32
#define RFC_ULLRAM_BANK11646_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11646_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11647
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11647_DATA_W                                         32
#define RFC_ULLRAM_BANK11647_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11647_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11648
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11648_DATA_W                                         32
#define RFC_ULLRAM_BANK11648_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11648_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11649
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11649_DATA_W                                         32
#define RFC_ULLRAM_BANK11649_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11649_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11650
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11650_DATA_W                                         32
#define RFC_ULLRAM_BANK11650_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11650_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11651
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11651_DATA_W                                         32
#define RFC_ULLRAM_BANK11651_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11651_DATA_S                                          0

