TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11652
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11652_DATA_W                                         32
#define RFC_ULLRAM_BANK11652_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11652_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11653
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11653_DATA_W                                         32
#define RFC_ULLRAM_BANK11653_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11653_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11654
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11654_DATA_W                                         32
#define RFC_ULLRAM_BANK11654_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11654_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11655
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11655_DATA_W                                         32
#define RFC_ULLRAM_BANK11655_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11655_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11656
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11656_DATA_W                                         32
#define RFC_ULLRAM_BANK11656_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11656_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11657
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11657_DATA_W                                         32
#define RFC_ULLRAM_BANK11657_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11657_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11658
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11658_DATA_W                                         32
#define RFC_ULLRAM_BANK11658_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11658_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11659
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11659_DATA_W                                         32
#define RFC_ULLRAM_BANK11659_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11659_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11660
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11660_DATA_W                                         32
#define RFC_ULLRAM_BANK11660_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11660_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11661
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11661_DATA_W                                         32
#define RFC_ULLRAM_BANK11661_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11661_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11662
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11662_DATA_W                                         32
#define RFC_ULLRAM_BANK11662_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11662_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11663
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11663_DATA_W                                         32
#define RFC_ULLRAM_BANK11663_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11663_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11664
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11664_DATA_W                                         32
#define RFC_ULLRAM_BANK11664_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11664_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11665
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11665_DATA_W                                         32
#define RFC_ULLRAM_BANK11665_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11665_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11666
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11666_DATA_W                                         32
#define RFC_ULLRAM_BANK11666_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11666_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11667
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11667_DATA_W                                         32
#define RFC_ULLRAM_BANK11667_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11667_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11668
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11668_DATA_W                                         32
#define RFC_ULLRAM_BANK11668_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11668_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11669
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11669_DATA_W                                         32
#define RFC_ULLRAM_BANK11669_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11669_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11670
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11670_DATA_W                                         32
#define RFC_ULLRAM_BANK11670_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11670_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11671
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11671_DATA_W                                         32
#define RFC_ULLRAM_BANK11671_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11671_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11672
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11672_DATA_W                                         32
#define RFC_ULLRAM_BANK11672_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11672_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11673
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11673_DATA_W                                         32
#define RFC_ULLRAM_BANK11673_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11673_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11674
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11674_DATA_W                                         32
#define RFC_ULLRAM_BANK11674_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11674_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11675
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11675_DATA_W                                         32
#define RFC_ULLRAM_BANK11675_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11675_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11676
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11676_DATA_W                                         32
#define RFC_ULLRAM_BANK11676_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11676_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11677
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11677_DATA_W                                         32
#define RFC_ULLRAM_BANK11677_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11677_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11678
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11678_DATA_W                                         32
#define RFC_ULLRAM_BANK11678_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11678_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11679
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11679_DATA_W                                         32
#define RFC_ULLRAM_BANK11679_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11679_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11680
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11680_DATA_W                                         32
#define RFC_ULLRAM_BANK11680_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11680_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11681
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11681_DATA_W                                         32
#define RFC_ULLRAM_BANK11681_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11681_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11682
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11682_DATA_W                                         32
#define RFC_ULLRAM_BANK11682_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11682_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11683
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11683_DATA_W                                         32
#define RFC_ULLRAM_BANK11683_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11683_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11684
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11684_DATA_W                                         32
#define RFC_ULLRAM_BANK11684_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11684_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11685
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11685_DATA_W                                         32
#define RFC_ULLRAM_BANK11685_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11685_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11686
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11686_DATA_W                                         32
#define RFC_ULLRAM_BANK11686_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11686_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11687
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11687_DATA_W                                         32
#define RFC_ULLRAM_BANK11687_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11687_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11688
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11688_DATA_W                                         32
#define RFC_ULLRAM_BANK11688_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11688_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11689
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11689_DATA_W                                         32
#define RFC_ULLRAM_BANK11689_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11689_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11690
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11690_DATA_W                                         32
#define RFC_ULLRAM_BANK11690_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11690_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11691
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11691_DATA_W                                         32
#define RFC_ULLRAM_BANK11691_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11691_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11692
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11692_DATA_W                                         32
#define RFC_ULLRAM_BANK11692_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11692_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11693
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11693_DATA_W                                         32
#define RFC_ULLRAM_BANK11693_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11693_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11694
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11694_DATA_W                                         32
#define RFC_ULLRAM_BANK11694_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11694_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11695
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11695_DATA_W                                         32
#define RFC_ULLRAM_BANK11695_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11695_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11696
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11696_DATA_W                                         32
#define RFC_ULLRAM_BANK11696_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11696_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11697
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11697_DATA_W                                         32
#define RFC_ULLRAM_BANK11697_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11697_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11698
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11698_DATA_W                                         32
#define RFC_ULLRAM_BANK11698_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11698_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11699
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11699_DATA_W                                         32
#define RFC_ULLRAM_BANK11699_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11699_DATA_S                                          0

