TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11700
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11700_DATA_W                                         32
#define RFC_ULLRAM_BANK11700_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11700_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11701
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11701_DATA_W                                         32
#define RFC_ULLRAM_BANK11701_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11701_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11702
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11702_DATA_W                                         32
#define RFC_ULLRAM_BANK11702_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11702_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11703
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11703_DATA_W                                         32
#define RFC_ULLRAM_BANK11703_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11703_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11704
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11704_DATA_W                                         32
#define RFC_ULLRAM_BANK11704_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11704_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11705
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11705_DATA_W                                         32
#define RFC_ULLRAM_BANK11705_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11705_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11706
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11706_DATA_W                                         32
#define RFC_ULLRAM_BANK11706_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11706_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11707
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11707_DATA_W                                         32
#define RFC_ULLRAM_BANK11707_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11707_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11708
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11708_DATA_W                                         32
#define RFC_ULLRAM_BANK11708_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11708_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11709
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11709_DATA_W                                         32
#define RFC_ULLRAM_BANK11709_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11709_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11710
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11710_DATA_W                                         32
#define RFC_ULLRAM_BANK11710_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11710_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11711
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11711_DATA_W                                         32
#define RFC_ULLRAM_BANK11711_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11711_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11712
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11712_DATA_W                                         32
#define RFC_ULLRAM_BANK11712_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11712_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11713
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11713_DATA_W                                         32
#define RFC_ULLRAM_BANK11713_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11713_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11714
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11714_DATA_W                                         32
#define RFC_ULLRAM_BANK11714_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11714_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11715
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11715_DATA_W                                         32
#define RFC_ULLRAM_BANK11715_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11715_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11716
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11716_DATA_W                                         32
#define RFC_ULLRAM_BANK11716_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11716_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11717
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11717_DATA_W                                         32
#define RFC_ULLRAM_BANK11717_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11717_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11718
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11718_DATA_W                                         32
#define RFC_ULLRAM_BANK11718_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11718_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11719
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11719_DATA_W                                         32
#define RFC_ULLRAM_BANK11719_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11719_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11720
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11720_DATA_W                                         32
#define RFC_ULLRAM_BANK11720_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11720_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11721
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11721_DATA_W                                         32
#define RFC_ULLRAM_BANK11721_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11721_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11722
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11722_DATA_W                                         32
#define RFC_ULLRAM_BANK11722_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11722_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11723
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11723_DATA_W                                         32
#define RFC_ULLRAM_BANK11723_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11723_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11724
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11724_DATA_W                                         32
#define RFC_ULLRAM_BANK11724_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11724_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11725
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11725_DATA_W                                         32
#define RFC_ULLRAM_BANK11725_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11725_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11726
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11726_DATA_W                                         32
#define RFC_ULLRAM_BANK11726_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11726_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11727
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11727_DATA_W                                         32
#define RFC_ULLRAM_BANK11727_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11727_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11728
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11728_DATA_W                                         32
#define RFC_ULLRAM_BANK11728_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11728_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11729
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11729_DATA_W                                         32
#define RFC_ULLRAM_BANK11729_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11729_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11730
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11730_DATA_W                                         32
#define RFC_ULLRAM_BANK11730_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11730_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11731
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11731_DATA_W                                         32
#define RFC_ULLRAM_BANK11731_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11731_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11732
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11732_DATA_W                                         32
#define RFC_ULLRAM_BANK11732_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11732_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11733
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11733_DATA_W                                         32
#define RFC_ULLRAM_BANK11733_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11733_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11734
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11734_DATA_W                                         32
#define RFC_ULLRAM_BANK11734_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11734_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11735
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11735_DATA_W                                         32
#define RFC_ULLRAM_BANK11735_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11735_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11736
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11736_DATA_W                                         32
#define RFC_ULLRAM_BANK11736_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11736_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11737
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11737_DATA_W                                         32
#define RFC_ULLRAM_BANK11737_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11737_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11738
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11738_DATA_W                                         32
#define RFC_ULLRAM_BANK11738_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11738_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11739
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11739_DATA_W                                         32
#define RFC_ULLRAM_BANK11739_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11739_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11740
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11740_DATA_W                                         32
#define RFC_ULLRAM_BANK11740_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11740_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11741
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11741_DATA_W                                         32
#define RFC_ULLRAM_BANK11741_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11741_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11742
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11742_DATA_W                                         32
#define RFC_ULLRAM_BANK11742_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11742_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11743
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11743_DATA_W                                         32
#define RFC_ULLRAM_BANK11743_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11743_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11744
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11744_DATA_W                                         32
#define RFC_ULLRAM_BANK11744_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11744_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11745
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11745_DATA_W                                         32
#define RFC_ULLRAM_BANK11745_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11745_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11746
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11746_DATA_W                                         32
#define RFC_ULLRAM_BANK11746_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11746_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11747
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11747_DATA_W                                         32
#define RFC_ULLRAM_BANK11747_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11747_DATA_S                                          0

