TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11748
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11748_DATA_W                                         32
#define RFC_ULLRAM_BANK11748_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11748_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11749
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11749_DATA_W                                         32
#define RFC_ULLRAM_BANK11749_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11749_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11750
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11750_DATA_W                                         32
#define RFC_ULLRAM_BANK11750_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11750_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11751
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11751_DATA_W                                         32
#define RFC_ULLRAM_BANK11751_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11751_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11752
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11752_DATA_W                                         32
#define RFC_ULLRAM_BANK11752_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11752_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11753
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11753_DATA_W                                         32
#define RFC_ULLRAM_BANK11753_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11753_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11754
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11754_DATA_W                                         32
#define RFC_ULLRAM_BANK11754_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11754_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11755
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11755_DATA_W                                         32
#define RFC_ULLRAM_BANK11755_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11755_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11756
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11756_DATA_W                                         32
#define RFC_ULLRAM_BANK11756_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11756_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11757
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11757_DATA_W                                         32
#define RFC_ULLRAM_BANK11757_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11757_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11758
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11758_DATA_W                                         32
#define RFC_ULLRAM_BANK11758_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11758_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11759
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11759_DATA_W                                         32
#define RFC_ULLRAM_BANK11759_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11759_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11760
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11760_DATA_W                                         32
#define RFC_ULLRAM_BANK11760_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11760_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11761
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11761_DATA_W                                         32
#define RFC_ULLRAM_BANK11761_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11761_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11762
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11762_DATA_W                                         32
#define RFC_ULLRAM_BANK11762_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11762_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11763
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11763_DATA_W                                         32
#define RFC_ULLRAM_BANK11763_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11763_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11764
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11764_DATA_W                                         32
#define RFC_ULLRAM_BANK11764_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11764_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11765
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11765_DATA_W                                         32
#define RFC_ULLRAM_BANK11765_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11765_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11766
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11766_DATA_W                                         32
#define RFC_ULLRAM_BANK11766_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11766_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11767
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11767_DATA_W                                         32
#define RFC_ULLRAM_BANK11767_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11767_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11768
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11768_DATA_W                                         32
#define RFC_ULLRAM_BANK11768_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11768_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11769
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11769_DATA_W                                         32
#define RFC_ULLRAM_BANK11769_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11769_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11770
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11770_DATA_W                                         32
#define RFC_ULLRAM_BANK11770_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11770_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11771
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11771_DATA_W                                         32
#define RFC_ULLRAM_BANK11771_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11771_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11772
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11772_DATA_W                                         32
#define RFC_ULLRAM_BANK11772_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11772_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11773
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11773_DATA_W                                         32
#define RFC_ULLRAM_BANK11773_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11773_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11774
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11774_DATA_W                                         32
#define RFC_ULLRAM_BANK11774_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11774_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11775
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11775_DATA_W                                         32
#define RFC_ULLRAM_BANK11775_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11775_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11776
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11776_DATA_W                                         32
#define RFC_ULLRAM_BANK11776_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11776_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11777
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11777_DATA_W                                         32
#define RFC_ULLRAM_BANK11777_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11777_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11778
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11778_DATA_W                                         32
#define RFC_ULLRAM_BANK11778_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11778_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11779
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11779_DATA_W                                         32
#define RFC_ULLRAM_BANK11779_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11779_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11780
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11780_DATA_W                                         32
#define RFC_ULLRAM_BANK11780_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11780_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11781
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11781_DATA_W                                         32
#define RFC_ULLRAM_BANK11781_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11781_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11782
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11782_DATA_W                                         32
#define RFC_ULLRAM_BANK11782_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11782_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11783
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11783_DATA_W                                         32
#define RFC_ULLRAM_BANK11783_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11783_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11784
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11784_DATA_W                                         32
#define RFC_ULLRAM_BANK11784_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11784_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11785
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11785_DATA_W                                         32
#define RFC_ULLRAM_BANK11785_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11785_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11786
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11786_DATA_W                                         32
#define RFC_ULLRAM_BANK11786_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11786_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11787
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11787_DATA_W                                         32
#define RFC_ULLRAM_BANK11787_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11787_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11788
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11788_DATA_W                                         32
#define RFC_ULLRAM_BANK11788_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11788_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11789
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11789_DATA_W                                         32
#define RFC_ULLRAM_BANK11789_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11789_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11790
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11790_DATA_W                                         32
#define RFC_ULLRAM_BANK11790_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11790_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11791
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11791_DATA_W                                         32
#define RFC_ULLRAM_BANK11791_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11791_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11792
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11792_DATA_W                                         32
#define RFC_ULLRAM_BANK11792_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11792_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11793
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11793_DATA_W                                         32
#define RFC_ULLRAM_BANK11793_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11793_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11794
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11794_DATA_W                                         32
#define RFC_ULLRAM_BANK11794_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11794_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11795
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11795_DATA_W                                         32
#define RFC_ULLRAM_BANK11795_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11795_DATA_S                                          0

