TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11844
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11844_DATA_W                                         32
#define RFC_ULLRAM_BANK11844_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11844_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11845
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11845_DATA_W                                         32
#define RFC_ULLRAM_BANK11845_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11845_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11846
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11846_DATA_W                                         32
#define RFC_ULLRAM_BANK11846_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11846_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11847
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11847_DATA_W                                         32
#define RFC_ULLRAM_BANK11847_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11847_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11848
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11848_DATA_W                                         32
#define RFC_ULLRAM_BANK11848_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11848_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11849
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11849_DATA_W                                         32
#define RFC_ULLRAM_BANK11849_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11849_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11850
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11850_DATA_W                                         32
#define RFC_ULLRAM_BANK11850_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11850_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11851
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11851_DATA_W                                         32
#define RFC_ULLRAM_BANK11851_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11851_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11852
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11852_DATA_W                                         32
#define RFC_ULLRAM_BANK11852_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11852_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11853
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11853_DATA_W                                         32
#define RFC_ULLRAM_BANK11853_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11853_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11854
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11854_DATA_W                                         32
#define RFC_ULLRAM_BANK11854_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11854_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11855
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11855_DATA_W                                         32
#define RFC_ULLRAM_BANK11855_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11855_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11856
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11856_DATA_W                                         32
#define RFC_ULLRAM_BANK11856_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11856_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11857
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11857_DATA_W                                         32
#define RFC_ULLRAM_BANK11857_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11857_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11858
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11858_DATA_W                                         32
#define RFC_ULLRAM_BANK11858_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11858_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11859
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11859_DATA_W                                         32
#define RFC_ULLRAM_BANK11859_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11859_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11860
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11860_DATA_W                                         32
#define RFC_ULLRAM_BANK11860_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11860_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11861
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11861_DATA_W                                         32
#define RFC_ULLRAM_BANK11861_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11861_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11862
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11862_DATA_W                                         32
#define RFC_ULLRAM_BANK11862_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11862_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11863
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11863_DATA_W                                         32
#define RFC_ULLRAM_BANK11863_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11863_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11864
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11864_DATA_W                                         32
#define RFC_ULLRAM_BANK11864_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11864_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11865
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11865_DATA_W                                         32
#define RFC_ULLRAM_BANK11865_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11865_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11866
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11866_DATA_W                                         32
#define RFC_ULLRAM_BANK11866_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11866_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11867
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11867_DATA_W                                         32
#define RFC_ULLRAM_BANK11867_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11867_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11868
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11868_DATA_W                                         32
#define RFC_ULLRAM_BANK11868_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11868_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11869
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11869_DATA_W                                         32
#define RFC_ULLRAM_BANK11869_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11869_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11870
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11870_DATA_W                                         32
#define RFC_ULLRAM_BANK11870_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11870_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11871
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11871_DATA_W                                         32
#define RFC_ULLRAM_BANK11871_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11871_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11872
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11872_DATA_W                                         32
#define RFC_ULLRAM_BANK11872_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11872_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11873
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11873_DATA_W                                         32
#define RFC_ULLRAM_BANK11873_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11873_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11874
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11874_DATA_W                                         32
#define RFC_ULLRAM_BANK11874_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11874_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11875
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11875_DATA_W                                         32
#define RFC_ULLRAM_BANK11875_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11875_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11876
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11876_DATA_W                                         32
#define RFC_ULLRAM_BANK11876_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11876_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11877
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11877_DATA_W                                         32
#define RFC_ULLRAM_BANK11877_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11877_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11878
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11878_DATA_W                                         32
#define RFC_ULLRAM_BANK11878_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11878_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11879
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11879_DATA_W                                         32
#define RFC_ULLRAM_BANK11879_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11879_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11880
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11880_DATA_W                                         32
#define RFC_ULLRAM_BANK11880_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11880_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11881
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11881_DATA_W                                         32
#define RFC_ULLRAM_BANK11881_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11881_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11882
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11882_DATA_W                                         32
#define RFC_ULLRAM_BANK11882_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11882_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11883
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11883_DATA_W                                         32
#define RFC_ULLRAM_BANK11883_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11883_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11884
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11884_DATA_W                                         32
#define RFC_ULLRAM_BANK11884_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11884_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11885
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11885_DATA_W                                         32
#define RFC_ULLRAM_BANK11885_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11885_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11886
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11886_DATA_W                                         32
#define RFC_ULLRAM_BANK11886_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11886_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11887
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11887_DATA_W                                         32
#define RFC_ULLRAM_BANK11887_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11887_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11888
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11888_DATA_W                                         32
#define RFC_ULLRAM_BANK11888_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11888_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11889
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11889_DATA_W                                         32
#define RFC_ULLRAM_BANK11889_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11889_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11890
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11890_DATA_W                                         32
#define RFC_ULLRAM_BANK11890_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11890_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11891
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11891_DATA_W                                         32
#define RFC_ULLRAM_BANK11891_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11891_DATA_S                                          0

