TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11892
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11892_DATA_W                                         32
#define RFC_ULLRAM_BANK11892_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11892_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11893
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11893_DATA_W                                         32
#define RFC_ULLRAM_BANK11893_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11893_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11894
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11894_DATA_W                                         32
#define RFC_ULLRAM_BANK11894_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11894_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11895
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11895_DATA_W                                         32
#define RFC_ULLRAM_BANK11895_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11895_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11896
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11896_DATA_W                                         32
#define RFC_ULLRAM_BANK11896_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11896_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11897
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11897_DATA_W                                         32
#define RFC_ULLRAM_BANK11897_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11897_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11898
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11898_DATA_W                                         32
#define RFC_ULLRAM_BANK11898_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11898_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11899
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11899_DATA_W                                         32
#define RFC_ULLRAM_BANK11899_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11899_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11900
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11900_DATA_W                                         32
#define RFC_ULLRAM_BANK11900_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11900_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11901
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11901_DATA_W                                         32
#define RFC_ULLRAM_BANK11901_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11901_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11902
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11902_DATA_W                                         32
#define RFC_ULLRAM_BANK11902_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11902_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11903
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11903_DATA_W                                         32
#define RFC_ULLRAM_BANK11903_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11903_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11904
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11904_DATA_W                                         32
#define RFC_ULLRAM_BANK11904_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11904_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11905
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11905_DATA_W                                         32
#define RFC_ULLRAM_BANK11905_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11905_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11906
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11906_DATA_W                                         32
#define RFC_ULLRAM_BANK11906_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11906_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11907
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11907_DATA_W                                         32
#define RFC_ULLRAM_BANK11907_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11907_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11908
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11908_DATA_W                                         32
#define RFC_ULLRAM_BANK11908_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11908_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11909
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11909_DATA_W                                         32
#define RFC_ULLRAM_BANK11909_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11909_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11910
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11910_DATA_W                                         32
#define RFC_ULLRAM_BANK11910_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11910_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11911
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11911_DATA_W                                         32
#define RFC_ULLRAM_BANK11911_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11911_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11912
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11912_DATA_W                                         32
#define RFC_ULLRAM_BANK11912_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11912_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11913
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11913_DATA_W                                         32
#define RFC_ULLRAM_BANK11913_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11913_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11914
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11914_DATA_W                                         32
#define RFC_ULLRAM_BANK11914_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11914_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11915
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11915_DATA_W                                         32
#define RFC_ULLRAM_BANK11915_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11915_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11916
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11916_DATA_W                                         32
#define RFC_ULLRAM_BANK11916_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11916_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11917
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11917_DATA_W                                         32
#define RFC_ULLRAM_BANK11917_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11917_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11918
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11918_DATA_W                                         32
#define RFC_ULLRAM_BANK11918_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11918_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11919
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11919_DATA_W                                         32
#define RFC_ULLRAM_BANK11919_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11919_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11920
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11920_DATA_W                                         32
#define RFC_ULLRAM_BANK11920_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11920_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11921
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11921_DATA_W                                         32
#define RFC_ULLRAM_BANK11921_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11921_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11922
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11922_DATA_W                                         32
#define RFC_ULLRAM_BANK11922_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11922_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11923
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11923_DATA_W                                         32
#define RFC_ULLRAM_BANK11923_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11923_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11924
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11924_DATA_W                                         32
#define RFC_ULLRAM_BANK11924_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11924_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11925
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11925_DATA_W                                         32
#define RFC_ULLRAM_BANK11925_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11925_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11926
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11926_DATA_W                                         32
#define RFC_ULLRAM_BANK11926_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11926_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11927
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11927_DATA_W                                         32
#define RFC_ULLRAM_BANK11927_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11927_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11928
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11928_DATA_W                                         32
#define RFC_ULLRAM_BANK11928_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11928_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11929
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11929_DATA_W                                         32
#define RFC_ULLRAM_BANK11929_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11929_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11930
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11930_DATA_W                                         32
#define RFC_ULLRAM_BANK11930_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11930_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11931
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11931_DATA_W                                         32
#define RFC_ULLRAM_BANK11931_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11931_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11932
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11932_DATA_W                                         32
#define RFC_ULLRAM_BANK11932_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11932_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11933
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11933_DATA_W                                         32
#define RFC_ULLRAM_BANK11933_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11933_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11934
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11934_DATA_W                                         32
#define RFC_ULLRAM_BANK11934_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11934_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11935
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11935_DATA_W                                         32
#define RFC_ULLRAM_BANK11935_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11935_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11936
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11936_DATA_W                                         32
#define RFC_ULLRAM_BANK11936_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11936_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11937
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11937_DATA_W                                         32
#define RFC_ULLRAM_BANK11937_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11937_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11938
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11938_DATA_W                                         32
#define RFC_ULLRAM_BANK11938_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11938_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11939
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11939_DATA_W                                         32
#define RFC_ULLRAM_BANK11939_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11939_DATA_S                                          0

