TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11940
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11940_DATA_W                                         32
#define RFC_ULLRAM_BANK11940_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11940_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11941
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11941_DATA_W                                         32
#define RFC_ULLRAM_BANK11941_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11941_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11942
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11942_DATA_W                                         32
#define RFC_ULLRAM_BANK11942_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11942_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11943
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11943_DATA_W                                         32
#define RFC_ULLRAM_BANK11943_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11943_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11944
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11944_DATA_W                                         32
#define RFC_ULLRAM_BANK11944_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11944_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11945
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11945_DATA_W                                         32
#define RFC_ULLRAM_BANK11945_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11945_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11946
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11946_DATA_W                                         32
#define RFC_ULLRAM_BANK11946_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11946_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11947
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11947_DATA_W                                         32
#define RFC_ULLRAM_BANK11947_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11947_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11948
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11948_DATA_W                                         32
#define RFC_ULLRAM_BANK11948_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11948_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11949
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11949_DATA_W                                         32
#define RFC_ULLRAM_BANK11949_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11949_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11950
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11950_DATA_W                                         32
#define RFC_ULLRAM_BANK11950_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11950_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11951
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11951_DATA_W                                         32
#define RFC_ULLRAM_BANK11951_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11951_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11952
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11952_DATA_W                                         32
#define RFC_ULLRAM_BANK11952_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11952_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11953
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11953_DATA_W                                         32
#define RFC_ULLRAM_BANK11953_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11953_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11954
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11954_DATA_W                                         32
#define RFC_ULLRAM_BANK11954_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11954_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11955
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11955_DATA_W                                         32
#define RFC_ULLRAM_BANK11955_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11955_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11956
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11956_DATA_W                                         32
#define RFC_ULLRAM_BANK11956_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11956_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11957
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11957_DATA_W                                         32
#define RFC_ULLRAM_BANK11957_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11957_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11958
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11958_DATA_W                                         32
#define RFC_ULLRAM_BANK11958_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11958_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11959
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11959_DATA_W                                         32
#define RFC_ULLRAM_BANK11959_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11959_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11960
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11960_DATA_W                                         32
#define RFC_ULLRAM_BANK11960_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11960_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11961
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11961_DATA_W                                         32
#define RFC_ULLRAM_BANK11961_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11961_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11962
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11962_DATA_W                                         32
#define RFC_ULLRAM_BANK11962_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11962_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11963
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11963_DATA_W                                         32
#define RFC_ULLRAM_BANK11963_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11963_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11964
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11964_DATA_W                                         32
#define RFC_ULLRAM_BANK11964_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11964_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11965
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11965_DATA_W                                         32
#define RFC_ULLRAM_BANK11965_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11965_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11966
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11966_DATA_W                                         32
#define RFC_ULLRAM_BANK11966_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11966_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11967
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11967_DATA_W                                         32
#define RFC_ULLRAM_BANK11967_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11967_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11968
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11968_DATA_W                                         32
#define RFC_ULLRAM_BANK11968_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11968_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11969
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11969_DATA_W                                         32
#define RFC_ULLRAM_BANK11969_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11969_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11970
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11970_DATA_W                                         32
#define RFC_ULLRAM_BANK11970_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11970_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11971
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11971_DATA_W                                         32
#define RFC_ULLRAM_BANK11971_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11971_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11972
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11972_DATA_W                                         32
#define RFC_ULLRAM_BANK11972_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11972_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11973
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11973_DATA_W                                         32
#define RFC_ULLRAM_BANK11973_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11973_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11974
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11974_DATA_W                                         32
#define RFC_ULLRAM_BANK11974_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11974_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11975
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11975_DATA_W                                         32
#define RFC_ULLRAM_BANK11975_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11975_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11976
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11976_DATA_W                                         32
#define RFC_ULLRAM_BANK11976_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11976_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11977
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11977_DATA_W                                         32
#define RFC_ULLRAM_BANK11977_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11977_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11978
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11978_DATA_W                                         32
#define RFC_ULLRAM_BANK11978_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11978_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11979
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11979_DATA_W                                         32
#define RFC_ULLRAM_BANK11979_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11979_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11980
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11980_DATA_W                                         32
#define RFC_ULLRAM_BANK11980_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11980_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11981
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11981_DATA_W                                         32
#define RFC_ULLRAM_BANK11981_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11981_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11982
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11982_DATA_W                                         32
#define RFC_ULLRAM_BANK11982_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11982_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11983
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11983_DATA_W                                         32
#define RFC_ULLRAM_BANK11983_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11983_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11984
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11984_DATA_W                                         32
#define RFC_ULLRAM_BANK11984_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11984_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11985
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11985_DATA_W                                         32
#define RFC_ULLRAM_BANK11985_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11985_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11986
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11986_DATA_W                                         32
#define RFC_ULLRAM_BANK11986_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11986_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11987
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11987_DATA_W                                         32
#define RFC_ULLRAM_BANK11987_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11987_DATA_S                                          0

