TexasInstruments/simplelink-lowpower-f2-sdk/source/ti/devices/cc13x4_cc26x4/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12036
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12036_DATA_W                                         32
#define RFC_ULLRAM_BANK12036_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12036_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12037
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12037_DATA_W                                         32
#define RFC_ULLRAM_BANK12037_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12037_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12038
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12038_DATA_W                                         32
#define RFC_ULLRAM_BANK12038_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12038_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12039
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12039_DATA_W                                         32
#define RFC_ULLRAM_BANK12039_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12039_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12040
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12040_DATA_W                                         32
#define RFC_ULLRAM_BANK12040_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12040_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12041
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12041_DATA_W                                         32
#define RFC_ULLRAM_BANK12041_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12041_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12042
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12042_DATA_W                                         32
#define RFC_ULLRAM_BANK12042_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12042_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12043
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12043_DATA_W                                         32
#define RFC_ULLRAM_BANK12043_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12043_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12044
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12044_DATA_W                                         32
#define RFC_ULLRAM_BANK12044_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12044_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12045
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12045_DATA_W                                         32
#define RFC_ULLRAM_BANK12045_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12045_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12046
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12046_DATA_W                                         32
#define RFC_ULLRAM_BANK12046_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12046_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12047
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12047_DATA_W                                         32
#define RFC_ULLRAM_BANK12047_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12047_DATA_S                                          0


#endif // __RFC_ULLRAM__
